[
    {
      "name": "Біткоїн – це:",
      "value": "Обидва варіанти правильні"
   },
   {
      "name": "Блокчейн-адреса — це:\nВиберіть НЕ правильний варіант",
      "value": "Хеш закритого ключа"
   },
   {
      "name": "Виберіть НЕ правильну відповідь Консенсус – це",
      "value": "Об’єднання всіх учасників блокчейн-мережі"
   },
   {
      "name": "Винагорода валідатора Етеріуму:",
      "value": "Становить 4–5% річних + комісія, яку платить користувач мережі"
   },
   {
      "name": "Група людей запропонували зміни у коді криптовалюти (наприклад, Біткоїн), але спільнота не прийняла чи вважає неважливими ці зміни.\nВирішили робити форк: створювати нову гілку нової криптовалюти, яка базується на історії наявної, але має суттєві зміни (наприклад, Bitcoin Cash)\nЯк називається такий вид форку?\nПідказка: Введіть відповідь українською без пробілів, тобто софтфорк або хардфорк.",
      "value": "хардфорк"
   },
   {
      "name": "Етер — це:",
      "value": "Криптовалюта"
   },
   {
      "name": "Етеріум та Біткоїн — блокчейни L1.",
      "value": "Так"
   },
   {
      "name": "Ким НЕ є Сатоші Накамото?",
      "value": "Японський письменник"
   },
   {
      "name": "Навіщо потрібні сайдчейни?",
      "value": "Щоб передавати криптовалюти між основним та “бічним” ланцюгами мережі"
   },
   {
      "name": "Стейблкоїни можуть бути прив’язані:",
      "value": "Обидва варіанти правильні"
   },
   {
      "name": "Форк – це:\nВиберіть НЕ правильний варіант",
      "value": "Оновлення програмного забезпечення, в результаті якого ланцюг блоків не ділиться на два окремі"
   },
   {
      "name": "Хто був автором першої в історії згадки про біткоїн?",
      "value": "Невідома особа або група людей під псевдонімом Сатоші Накамото (Satoshi Nakamoto)"
   },
   {
      "name": "Хто має відношення до створення Біткоїну?",
      "value": "Сатоші Накамото"
   },
   {
      "name": "Чи можна перевірити будь-яку транзакцію на публічному блокчейні?",
      "value": "Так"
   },
   {
      "name": "Що є прикладом фіатної валюти?",
      "value": "Банкноти"
   },
   {
      "name": "Що з наведеного нижче є Proof-of-Stake?",
      "value": "Валідатори вибираються з ймовірністю, зваженою на суму етеру, яку вони ставлять, для створення нового блоку з новими транзакціями в ньому, ризикуючи спалити їхні ставки ефіру, якщо вони поводитимуться неправильно."
   },
   {
      "name": "Що з цього лого біткоїну?",
      "value": "Bitcoin"
   },
   {
      "name": "Що НЕ є Блокчейн:",
      "value": "Використовується лише у фінансовій галузі"
   },
   {
      "name": "Що таке \"генезис-блок\" у блокчейні?",
      "value": "Перший блок у ланцюжку"
   },
   {
      "name": "Що таке \"добивання\" (майнінг) у блокчейні?",
      "value": "Процес створення нових блоків у блокчейні та підтвердження транзакцій"
   },
   {
      "name": "Що таке \"криптовалюта\" у контексті блокчейну?",
      "value": "Цифровий актив, що працює за допомогою криптографії для безпечних фінансових транзакцій"
   },
   {
      "name": "Що таке \"смарт-контракт\" у блокчейні?",
      "value": "Програмний код, який автоматично виконує угоди при виконанні певних умов"
   },
   {
      "name": "Що таке \"форк\" у блокчейні?",
      "value": "Процес розділення блокчейну на дві або більше окремих гілок"
   },
   {
      "name": "Що таке \"хеш\" у контексті блокчейну?",
      "value": "Криптографічний алгоритм, який застосовується для створення унікального відображення даних"
   },
   {
      "name": "Що таке блокчейн?",
      "value": "Децентралізована база даних"
   },
   {
      "name": "Що таке блокчейн?",
      "value": "Розподілена база даних з використанням криптографії"
   },
   {
      "name": "Що таке мемпул?",
      "value": "Місце, де знаходяться всі непідтверджені транзакції"
   },
   {
      "name": "Що таке смарт-контракт?",
      "value": "Контракт, що виконується за допомогою коду автоматично після виконання певних умов"
   },
   {
      "name": "Що шукають майнери під час обчислень? \nСвоєрідний девіз криптоіндустрії звучить так:&nbsp;",
      "value": "Нонс"
   },
   {
      "name": "Як називається блокчейн-платформа для децентралізованих застосунків, яка запущена у 2015 році?",
      "value": "Ethereum"
   },
   {
      "name": "Які дані зберігаються в кожному блоку блокчейну?",
      "value": "Хеш попереднього блоку"
   },
   {
      "name": "Які переваги має децентралізований блокчейн у порівнянні з централізованим?",
      "value": "Більша стійкість до злому або атак"
   },
   {
      "name": "Які типи блокчейнів існують?",
      "value": "Публічні, приватні та гібридні"
   },
   {
      "name": "Яка з цих криптовалют не є альткоїном?",
      "value": "BitCoin"
   },
   {
      "name": "Яка криптовалюта була першою реалізацією технології блокчейн?",
      "value": "Bitcoin"
   },
   {
      "name": "Яка основна перевага блокчейну у порівнянні з централізованими системами?",
      "value": "Повна прозорість та невідворотність транзакцій"
   },
   {
      "name": "Яка основна перевага блокчейну?",
      "value": "Децентралізація та безпека"
   },
   {
      "name": "Яка різниця між ERC-20 і ERC-721?",
      "value": "ERC-20 є взаємозамінним, ERC-721 — незамінним"
   },
   {
      "name": "Яким чином блокчейн може бути використаний за межами фінансового сектору?",
      "value": "Для відслідковування походження продуктів у сфері логістики"
   },
   {
      "name": "Якщо ви можете читати інформацію на сайті, але не можете коментувати чи ділитись нею, то це:",
      "value": "Web 1"
   },
   {
      "name": "Хто НЕ придумав біткоїн?\nОберіть УСІ правильні варіанти",
      "value": "Віталік Бутерін"
   },
    {
      "name": "1. Кримінальний аналіз – це:",
      "value": "в) специфічний вид інформаційно-аналітичної діяльності, яка полягає в ідентифікації та якомога більш точному визначенні  внутрішніх зв’язків між інформаціями (відомостями, даними), що стосуються кримінальних правопорушень, і будь-якими іншими даними, отриманими з різних джерел, їх використанням в інтересах ведення оперативно-розшукової та слідчої діяльності, їх аналітичної підтримки, а також розроблення тактичних та стратегічних заходів із протидії правопорушенням;"
   },
   {
      "name": "10. Що відноситься до основного правила складання аналітичних схем:",
      "value": "г) прагнути до точності."
   },
   {
      "name": "11. Які типи висновків використовуються у кримінальному аналізі під час досудового розслідування кримінальних проваджень:",
      "value": "а) гіпотеза;"
   },
   {
      "name": "12. У чому полягає оцінка інформації:",
      "value": "а) у надійності джерела інформації, а також достовірності або правдивості її змісту;"
   },
   {
      "name": "13. Назвіть складові елементи кримінального аналізу:",
      "value": "б) опис даних;"
   },
   {
      "name": "14. Назвіть загальні критерії інформаційної цінності:",
      "value": "в) коректність;"
   },
   {
      "name": "15. Який вид мислення виходить за межі фактів:",
      "value": "а) індуктивний;"
   },
   {
      "name": "16. Що не відносить до елемента збору інформації:",
      "value": "в) визначення корисної інформації;"
   },
   {
      "name": "17. Яка з класифікацій джерел інформації є неправильною:",
      "value": "в) надійні джерела, фейкові джерела;"
   },
   {
      "name": "18. Що таке індукція, як метод обробки інформації: \n19. Який метод відносяться до основного методу оброки інформації: {\n~ а) моделювання;\n~ б) дедукція;\n~ в) графічне зображення;\n= г) всі відповіді вірні.\n}",
      "value": "а) метод пізнання, що ґрунтується на формально-логічному умовиводі, який дає можливість одержати загальний висновок на основі окремих фактів;"
   },
   {
      "name": "2. Метою кримінального аналізу є:",
      "value": "в) напрацювання нових напрямів у досудовому розслідуванні кримінального провадження;"
   },
   {
      "name": "20. Якої з наведених нижче схем опису даних не існує:",
      "value": "в) схема осіб;"
   },
   {
      "name": "21. В якій послідовності необхідно оцінювати інформацію, яка надійшла:",
      "value": "а) її релевантність, достовірність, актуальність;"
   },
   {
      "name": "22. Якої категорії оцінки надійності джерела за методом 4х4 не існує:",
      "value": "в) у всіх випадках не надійне;"
   },
   {
      "name": "23. Які категорії оцінки достовірності інформації відповідають методу 4х4:",
      "value": "б) інформація повністю достовірна; інформація відома джерелу особисто; інформація джерелу особисто невідома, але підтверджуються іншою інформацію; інформація джерелу невідома, і підтвердити її немає можливості;"
   },
   {
      "name": "24. Які групи кодів оціненої інформації будуть відповідати категорії – інформація що не потребує перевірки:",
      "value": "г) А1, А2, Б1."
   },
   {
      "name": "25. Процес оцінки достовірності інформації складається з:",
      "value": "б) двох рівнів;"
   },
   {
      "name": "26. Які є види джерел інформації за формою:",
      "value": "а) особисті, речові, ілюстративні (фотографічні), електронні;"
   },
   {
      "name": "27. Якого метода оцінки достовірності інформації не існує:",
      "value": "г) 9х9."
   },
   {
      "name": "28. Метод дослідження взаємозалежності ознак у генеральній сукупності, які є випадковими величинами з нормальним характером розподілу це:",
      "value": "а) кореляційний аналіз;"
   },
   {
      "name": "29. Короткий публічний виступ (прес-конференція), на якому учасники певних подій або заходів надають інформацію про поточний перебіг справ, позиції сторін, повідомляють раніше невідомі деталі та відповідають на питання представників засобів масової інформації:",
      "value": "б) брифінг;"
   },
   {
      "name": "3. Не відноситься до принципів кримінального аналізу:",
      "value": "г) оперативність."
   },
   {
      "name": "30. Формалізовано-творчий результат роботи аналітика, який вміщує дані або знання, які встановлені під час проведення кримінального аналізу і, який в залежності від виду, може містити опис матеріалів, на основі якого виконано аналітичну діяльність, її перебіг, сформульований на основі засновків (передумов) умовивід (висновок), а також рекомендації це:",
      "value": "а) аналітичний продукт;"
   },
   {
      "name": "31. Аналіз –це:",
      "value": "г) розкладання досліджуваного цілого на частини, виділення окремих ознак та якостей явища, процесу, відносин, явищ та процесів."
   },
   {
      "name": "32. Декомпозиція – це:",
      "value": "б) метод аналітичного характеру, який дозволяє досліджувати процеси і явища, завдяки якому фахівці розбивають мету на кілька невеликих під задач, рішення яких призводить до очікуваного результату;"
   },
   {
      "name": "33. Метод, який використовується для накопичення знань про механізм вчинення злочинів і діяльність з їх розслідування:",
      "value": "в) вивчення документів;"
   },
   {
      "name": "34. Графічні зображення за загальним призначенням поділяються:",
      "value": "б) аналітичні, ілюстративні, інформаційні;"
   },
   {
      "name": "35. Метод, який заснований на зіставленні властивостей або ознак кількох об’єктів:",
      "value": "а) порівняння;"
   },
   {
      "name": "36. Фундаментальний методпізнання дійсності, який ділив об’єкти дослідження на певні класи за допомогою виділення істотних ознак на основі виявлення їх гомогенності та гетерогенності:",
      "value": "а) класифікація;"
   },
   {
      "name": "37. Головною метою методу «Мозковий штурм» є:",
      "value": "в) відбір найбільш раціональних та достовірних ідей та припущень стосовно предмета дослідження для їх аналізу та вивчення;"
   },
   {
      "name": "38. Метод, в якому сукупність математичних методів, призначених для формування «віддалених» один від одного груп «близьких» між собою об’єктів за інформацією про відстані або зв’язки (заходи близькості) між ними:",
      "value": "в) метод «Кластерний аналіз»;"
   },
   {
      "name": "39. Метод, який полягає у стратегічному плануванні (конструюванні стратегій) для виявлення факторів внутрішнього і зовнішнього середовища організації:",
      "value": "г) метод «SWOT-аналіз»."
   },
   {
      "name": "4. Не відноситься до критеріїв кримінального аналізу:",
      "value": "а) важливість;"
   },
   {
      "name": "40. Метод метою якого є визначення найбільш вірогідних сценаріїв розвитку досудового розслідування кримінального провадження, а також розробка альтернативних планів проведення процесуальних дій та гнучких алгоритмів провадження слідчих (розшукових) дій, спрямованих на збір й дослідження доказів та встановлення обставин, що сприяли вчиненню злочину, з урахуванням об’єктивних факторів, які перебувають поза сферою впливу суб’єктів досудового розслідування.",
      "value": "б) метод оцінки ризиків «HAZOR»;"
   },
   {
      "name": "41. Будь-які цінності, які можна обміняти на готівку, або самі готівкові кошти (нерухомість, особисте майно, інвестиції в цінні папери, ощадні рахунки і рахунки до запитання тощо):",
      "value": "а) актив;"
   },
   {
      "name": "42. Що не є різновидом інверсій:",
      "value": "а) системи;"
   },
   {
      "name": "43. Метод, який полягає у генеруванні ідеї щодо предмета дослідження, деталізує його внутрішні логічні зв'язки, використовуючи графічний запис у виглядідіаграми:",
      "value": "г) метод «Карта роздумів»."
   },
   {
      "name": "44. Яку інформацію не можливо отримати в результаті аналізу телефонних з’єднань:",
      "value": "б) спосіб скоєння злочину;"
   },
   {
      "name": "45. Що ілюструє схема подій:",
      "value": "г) ілюструє хронологічний зв'язок між взаємозв'язаними подіями."
   },
   {
      "name": "46. Що не входить до аналізу телефонних дзвінків:",
      "value": "в) вилучення мобільного терміналу;"
   },
   {
      "name": "47. Деталізація і представлення у логічній послідовності конкретних дій, які відбуваються послідовно і одночасно, ілюструючи таким чином перебіг подій це:",
      "value": "а) метод побудови схеми діяльності;"
   },
   {
      "name": "48. Вивченні інформації про взаємозв’язки між суб’єктами – фізичними особами, юридичними особами, місцями та іншими об’єктами в графічному зображенні, для уточнення взаємозв’язків між ними і полегшення подальших висновків це:",
      "value": "в) метод побудови схеми взаємозв’язків;"
   },
   {
      "name": "49. Яке значення, відповідно до визначених кодів взаємозв’язків, має знак «+»:",
      "value": "а) підтверджений член організації;"
   },
   {
      "name": "5. Кримінальний аналітик – це:",
      "value": "в) особа, яка володіє спеціальними знаннями та навичками застосування технічних або інших засобів і може надавати консультації під час досудового розслідування і судового розгляду з питань, що потребують відповідних спеціальних знань і навичок;"
   },
   {
      "name": "50. Яке значення, відповідно до визначених кодів взаємозв’язків, має знак « »:",
      "value": "б) ймовірні взаємозв'язки між двома особами;"
   },
   {
      "name": "6. До видів аналітичного моделювання не відносяться:",
      "value": "в) аналіз механізму скоєння злочину;"
   },
   {
      "name": "7. Яким символом позначається наявність зв’язків між об’єктами:",
      "value": "в) «1»;"
   },
   {
      "name": "8. Яким символом позначається група чи організація в діаграмі зв’язків:",
      "value": "б) прямокутник;"
   },
   {
      "name": "9. Які інструменти не використовуються в аналізі подій, процесів:",
      "value": "б) прямокутна матриця;"
   },
    {
      "name": "Для чого використовується зворотня розробка?",
      "value": "Для аналізу програмного забезпечення та виявлення вразливостей."
   },
   {
      "name": "Для чого ми використовуємо віртуальні машини при аналізі шкідливого ПЗ?",
      "value": "Для ізоляції шкідливого ПЗ: Віртуальні машини дозволяють ізолювати шкідливе ПЗ від основної операційної системи, що зменшує ризик пошкодження або компрометації системи."
   },
   {
      "name": "Чи може зворотня розробка використовуватися для вчиненя противоправних дій? Якщо так, то яких саме?",
      "value": "Так, зворотня розробка може використовуватися для вчиненя противоправних дій. Наприклад, вона може використовуватися для створення несанкціонованих копій програмного забезпечення (піратства), виявлення та експлуатації вразливостей без дозволу власника, а також для створення та поширення шкідливого ПЗ."
   },
   {
      "name": "Чи може шкідливе ПЗ розуміти коли його запускають у віртуальному оточенні? Якщо так, як воно це робить та навіщо?",
      "value": "Так, шкідливе ПЗ може розуміти, коли його запускають у віртуальному оточенні. Воно може використовувати різні методи для виявлення віртуального оточення, такі як перевірка наявності певного апаратного або програмного забезпечення, що є характерним для віртуальних машин. Шкідливе ПЗ робить це, щоб уникнути виявлення та аналізу."
   },
   {
      "name": "Чи можна виконувати программу скомпільовану для архітектури процессора x86 на процессорі ARM64? Якщо так, то як це зробити?",
      "value": "Так, можна, але не безпосередньо. Програми, скомпільовані для архітектури x86, не можуть безпосередньо виконуватися на процесорах ARM64, оскільки команди процесора відрізняються. Однак, можна використовувати емулятори, такі як QEMU, для емуляції архітектури x86 на процесорах ARM64. Альтернативно, можна перекомпілювати програму під архітектуру ARM64."
   },
   {
      "name": "Чи можна використовувати Java для зворотньої розробки Android-додатків?",
      "value": "Так, оскільки Android-додатки зазвичай пишуться на Java."
   },
   {
      "name": "Чи можна повністью відновити початковий Java код з байт-коду? Якщо так, то як від цього захиститися?",
      "value": "Так, але з обмеженнями: Можна відновити Java код з байт-коду, але він може не відповідати оригіналу, особливо якщо була використана обфускація коду. Захист від зворотньої розробки можна забезпечити за допомогою обфускації коду та використання нативних методів."
   },
   {
      "name": "Чи можуть IoT-пристрої (пристрої інтернету речей) використовуватися як основа ботнету?",
      "value": "Так, можуть: IoT-пристрої можуть бути використані як основа ботнету, якщо вони мають вразливості, які дозволяють зловмисникам неконтрольовано керувати ними."
   },
   {
      "name": "Що з цього переліку Є компільованною мовою программування?",
      "value": "Golang (Go)"
   },
   {
      "name": "Що з цього переліку НЕ Є мовою програмування на основі байт-коду/IL-коду?",
      "value": "Ruby"
   },
   {
      "name": "Що таке \"sandbox/sandboxing\"?",
      "value": "Ізоляція додатку від основної ОС та інших додатків для захисту"
   },
   {
      "name": "Що таке .NET Reflector/ILSpy/dotPeek і як вони може бути використані при зворотній розробці бібліотек на C#?",
      "value": ".NET Reflector/ILSpy/dotPeek - це декомпілятори та браузери коду, які використовуються для перегляду та аналізу вихідного коду бібліотек на C"
   },
   {
      "name": "Що таке API Hooking і як він може бути використаний при зворотній розробці нативних додатків для Windows?",
      "value": "API Hooking - це процес зміни поведінки API за допомогою перехоплення викликів API і зміни їх поведінки."
   },
   {
      "name": "Що таке Dalvik і ART в контексті Android?",
      "value": "Dalvik і ART - це віртуальні машини, що використовуються в ОС Android для виконання байт-коду."
   },
   {
      "name": "Що таке DLL Injection і як він може бути використаний при зворотній розробці нативних додатків для Windows?",
      "value": "DLL Injection - це процес вставки коду DLL в простір адрес програми, що дозволяє виконувати код в контексті цієї програми."
   },
   {
      "name": "Що таке IDA Pro і як він може бути використаний при зворотній розробці нативних додатків для Windows?",
      "value": "IDA Pro - це інструмент для зворотньої розробки, який використовується для аналізу бінарних файлів і допомагає розуміти, що робить програма."
   },
   {
      "name": "Що таке JIT компіляція і як вона використовується в байт-код базованих мовах програмування?",
      "value": "JIT компіляція - це процес компіляції коду в момент виконання, що дозволяє оптимізувати виконання коду."
   },
   {
      "name": "Що таке PE (Portable Executable) формат файлу?",
      "value": "Це формат файлу, який використовується для зберігання виконуваних файлів, об’єктних файлів, DLL, FON файлів та інших в ОС Windows."
   },
   {
      "name": "Що таке REST API Reverse Engineering? Для чого нам це може бути потрібно?",
      "value": "REST API Reverse Engineering - це процес вивчення поведінки веб-додатку для виявлення та аналізу його API. Це може бути корисним для розробки сторонніх додатків, які взаємодіють з оригінальним сервісом."
   },
   {
      "name": "Що таке інтерпретатор початкового коду?",
      "value": "Інтерпретатор початкового коду - це програма чи технічні засоби, необхідні для виконання інших програм. Інтерпретатори можуть працювати як з початковим кодом програми, написаним мовою програмування, так і з байт-кодом."
   },
   {
      "name": "Що таке ассемблер?",
      "value": "Ассемблер - це комп’ютерна програма-транслятор, призначена для генерації машинного (двійкового) коду з символьного представлення цього коду (мови асемблера). Наприклад, текстовий рядок CLI для архітектури x86 перетворюється асемблером у двійковий код 111110101."
   },
   {
      "name": "Що таке байт-код/IL-код?",
      "value": "Байт-код/IL-код - це машинно-незалежний код низького рівня, який генерується транслятором і виконується інтерпретатором. Байт-код використовується для облегшення і прискорення роботи інтерпретатора. Байт-код є менш абстрактним і більш компактним, ніж початковий код, тому ефективність байт-коду зазвичай вища, ніж чиста інтерпретація початкового коду."
   },
   {
      "name": "Що таке віртуальна машина в контексті програмування?",
      "value": "Віртуальна машина - це програма, яка емулює роботу реального комп’ютера і може виконувати програми так, як це робить реальний комп’ютер."
   },
   {
      "name": "Що таке обфускація коду?",
      "value": "Обфускація коду - це процес приведення початкового коду або виконуваного програмного коду до вигляду, який зберігає його функціональність, але ускладнює аналіз, розуміння алгоритму роботи і модифікації при декомпіляції."
   },
   {
      "name": "Що таке сигнатура функції?",
      "value": "Це опис функції, який включає ім’я функції та типи її параметрів."
   },
   {
      "name": "Що таке шкідливе ПЗ?",
      "value": "Шкідливе ПЗ - це програмне забезпечення, що розроблене з метою завдання шкоди користувачам або комп’ютерним системам."
   },
   {
      "name": "Що таке “віртуальна машина” і як вона використовується в контексті зворотньої розробки?",
      "value": "Віртуальна машина - це програма, яка емулює апаратне забезпечення комп’ютера."
   },
   {
      "name": "Що таке “дизасемблер” і як він використовується в контексті зворотньої розробки?",
      "value": "Дизасемблер - це інструмент, який перетворює машинний код назад в асемблер."
   },
   {
      "name": "Що таке “машинний код” в контексті зворотньої розробки?",
      "value": "Це код, який виконується безпосередньо апаратним забезпеченням комп’ютера."
   },
   {
      "name": "Як можна захистити веб-додаток від зворотньої розробки?",
      "value": "Використовувати обфускацію коду, використовувати HTTPS для захисту трафіку, обмежувати доступ до вихідного коду."
   },
   {
      "name": "Які інструменти зазвичай використовуються для зворотньої розробки? \nЯкі основні методи зворотньої розробки використовуються для аналізу бінарного коду? {\n~ Статичний аналіз та динамічний аналіз.\n~ Аналіз вихідного коду та аналіз вхідного коду.\n~ Аналіз на рівні машинного коду та аналіз на рівні вихідного коду.\n= Всі вищезазначені варіанти.\n}",
      "value": "Дизасемблери та дебагери."
   },
   {
      "name": "Які інструменти можна використовувати для зворотньої розробки веб-додатків? \nЧи можна повністю відновити початковий код веб-додатку з його вихідного коду? {\n~ Так, оскільки вихідний код веб-додатку зазвичай доступний в браузері.\n~ Ні, оскільки вихідний код веб-додатку зазвичай обфускований.\n= Так, але лише якщо вихідний код веб-додатку не був обфускований.\n~ Ні, оскільки вихідний код веб-додатку зазвичай видаляється після завантаження сторінки.\n}",
      "value": "Веб-браузери з інструментами розробника, декомпілятори JavaScript, інструменти для аналізу HTTP-трафіку."
   },
   {
      "name": "Які інструменти часто використовуються для проведення реверс інжинірингу?",
      "value": "Декомпілятори"
   },
   {
      "name": "Які засоби є для захисту від реверс інжинірингу?",
      "value": "використання захисту DRM"
   },
   {
      "name": "Які мови програмування ви як спеціаліст по кібер-безпеці можете очікувати знайти у шкідливому ПЗ?",
      "value": "C, C++, C"
   },
   {
      "name": "Які основні виклики пов’язані з зворотною розробкою обфускованого коду?",
      "value": "Всі вищезазначені варіанти."
   },
   {
      "name": "Які основні кроки зворотньої розробки Android-додатку?",
      "value": "Декомпіляція APK-файлу, аналіз вихідного коду, модифікація коду, перекомпіляція APK-файлу."
   },
   {
      "name": "Які основні методи захисту від шкідливого ПЗ? \nЩо таке “рансомвар”? {\n~ Рансомвар - це тип шкідливого ПЗ, що видаляє дані користувача.\n~ Рансомвар - це тип шкідливого ПЗ, що блокує доступ до комп’ютера.\n~ Рансомвар - це тип шкідливого ПЗ, що використовується для виконання DDoS-атак.\n= Рансомвар - це тип шкідливого ПЗ, що шифрує дані користувача і вимагає викуп за їх розшифровку.\n}",
      "value": "Використання антивірусного ПЗ, регулярне оновлення системи та програм, обмеження прав користувача, резервне копіювання даних."
   },
   {
      "name": "Які основні методи реверс інжинірингу існують?",
      "value": "Динамічний та статичний аналіз."
   },
   {
      "name": "Які основні типи шкідливого ПЗ?",
      "value": "Віруси, черв’яки, трояни, руткіти, шпигунське ПЗ."
   },
   {
      "name": "Які переваги використання байт-коду?",
      "value": "Байт-код може бути виконаний на будь-якій платформі, що має віртуальну машину."
   },
   {
      "name": "Які переваги та недоліки компільованих мов програмування порівняно з інтерпретованими та байт-код базованими мовами?",
      "value": "Компільовані мови програмування виконуються швидше, але вони вимагають додаткового часу на компіляцію; інтерпретовані та байт-код базовані мови виконуються повільніше, але вони дозволяють більш гнучку розробку."
   },
   {
      "name": "Яка основна різниця між компільованими та інтерпретованими мовами програмування?",
      "value": "Компільовані мови програмування перетворюються на машинний код перед виконанням, тоді як інтерпретовані мови програмування виконуються безпосередньо інтерпретатором."
   },
   {
      "name": "Яким чином шкідливе ПЗ може маскувати свої сигнатури від сканування антивірусним ПЗ?",
      "value": "Використовуючи поліморфізм та метаморфізм: Шкідливе ПЗ може змінювати свій код при кожному запуску, що ускладнює його виявлення за допомогою сигнатурних сканувань."
   },
   {
      "name": "Якщо я, як розробник - розробив ПЗ яке можна вважати шкідливим, але не розповсюджую його, та використовую його лише в цілях демонстрації можливостей шкідливого ПЗ, чи порушую я українське законодавство?",
      "value": "Згідно зі статтею 361-1 Кримінального кодексу України, створення шкідливих програмних чи технічних засобів з метою протиправного використання, розповсюдження або збуту, а також їх розповсюдження або збут кваліфікується як злочин. Однак, якщо шкідливе ПЗ створено виключно в навчальних цілях, не розповсюджується та не використовується для протиправної дії, це може не вважатися порушенням закону."
   },
    {
      "name": "Атака «supply chain» – це коли:",
      "value": "Хакер спочатку компрометує менш захищену організацію, а вже через неї здійснює атаку на свою"
   },
   {
      "name": "Вішинг – це:",
      "value": "Різновид фішингу, який здійснюється через телефон"
   },
   {
      "name": "Хто розробив алгоритм Диффі — Хеллмана?",
      "value": "Уітфілд Диффі та Мартін Хеллман"
   },
   {
      "name": "Чому етичний хакінг є важливим аспектом в інформаційній безпеці?",
      "value": "Він допомагає виявляти і виправляти вразливості систем до того, як їх використають зловмисники."
   },
   {
      "name": "Що є головною перевагою алгоритму Диффі — Хеллмана?",
      "value": "Безпосереднє узгодження секретного ключа через відкритий канал"
   },
   {
      "name": "Що включає в себе етичний кодекс хакера?",
      "value": "Повагу до приватності користувачів та власників систем."
   },
   {
      "name": "Що включає в себе етичний хакінг?",
      "value": "Тестування комп'ютерних систем на вразливості за згодою власника системи для покращення їх безпеки."
   },
   {
      "name": "Що зберігають ARP-таблиці",
      "value": "Зберігають результати зіставлення IP-адрес та mac- адрес."
   },
   {
      "name": "Що означає \"Promiscuous Mode\" у Wireshark?",
      "value": "Режим, в якому програма показує всі пакети на мережі, незалежно від їх призначення"
   },
   {
      "name": "Що означає абревіатура ARP?",
      "value": "Address Resolution Protocol"
   },
   {
      "name": "Що робить алгоритм Диффі — Хеллмана стійким до прослуховування?",
      "value": "Використання секретних ключів, які генеруються випадковим чином"
   },
   {
      "name": "Що робить програма Wireshark?",
      "value": "Аналіз та моніторинг мережевого трафіку"
   },
   {
      "name": "Що собою представляє віртуальна машина Metasploitable?",
      "value": "сервер Linux"
   },
   {
      "name": "Що таке \"фільтр\" у Wireshark?",
      "value": "Вибіркове відображення пакетів, які відповідають певному критерію"
   },
   {
      "name": "Що таке \"червоний командир\" у контексті етичного хакінгу?",
      "value": "Експерт, який оцінює та керує етичними хакерськими командами."
   },
   {
      "name": "Що таке ARP-спуфінг?",
      "value": "Мережева атака канального рівня, при якій зловмисник надсилає підроблені повідомлення протоколу Address Resolution Protocol в локальну мережу."
   },
   {
      "name": "Що таке SSL/TLS?",
      "value": "Стандартний протокол для шифрування з'єднань у мережі Інтернет."
   },
   {
      "name": "Що таке асиметричне шифрування?",
      "value": "Метод шифрування, в якому використовуються два ключі: публічний і приватний."
   },
   {
      "name": "Що таке енкриптор?",
      "value": "Програма для шифрування даних."
   },
   {
      "name": "Що таке симетричне шифрування?",
      "value": "Метод шифрування, в якому використовується один і той самий ключ для як шифрування, так і дешифрування даних."
   },
   {
      "name": "Що таке шифрування даних?",
      "value": "Процес зміни форми даних, щоб зробити їх нерозбірливими для неавторизованих користувачів."
   },
   {
      "name": "Як етичний хакінг впливає на репутацію компаній та організацій?",
      "value": "Поліпшує репутацію, показуючи зацікавленість в покращенні безпеки та реакцію на виявлені вразливості."
   },
   {
      "name": "Як етичний хакінг допомагає збільшити захищеність користувачів інтернету?",
      "value": "Виявляє та усуває потенційні загрози для безпеки користувачів."
   },
   {
      "name": "Як етичний хакінг сприяє збільшенню обізнаності про загрози кібербезпеки?",
      "value": "Допомогою у виявленні та усуненні вразливостей, які можуть бути використані зловмисниками."
   },
   {
      "name": "Як етичний хакінг сприяє збільшенню обізнаності щодо загроз кібербезпеки?",
      "value": "Допомагає ідентифікувати та усувати потенційні загрози до того, як їх використають зловмисники."
   },
   {
      "name": "Як етичний хакінг сприяє розвитку кібербезпеки загалом?",
      "value": "Посиленням захисту важливих даних."
   },
   {
      "name": "Як етичний хакінг сприяє розвитку та покращенню інформаційної безпеки?",
      "value": "Виявленням вразливостей та пропозицією шляхів їх вирішення."
   },
   {
      "name": "Як можна відкрити захоплений файл у Wireshark?",
      "value": "File > Open"
   },
   {
      "name": "Як можна відрізнити ARP-спуфінг від звичайних ARP-запитів у мережі?",
      "value": "Перевіряючи відповідність MAC-адресів у ARP-відповідях та ARP-запитах"
   },
   {
      "name": "Як можна відфільтрувати пакети у Wireshark за IP-адресою призначення?",
      "value": "адреса"
   },
   {
      "name": "Як можна використовувати ARP-спуфінг для атаки \"Man-in-the-Middle\"?",
      "value": "Здійснення перехоплення та модифікації мережевого трафіку між двома або більше пристроями"
   },
   {
      "name": "Як можна виявити ARP-спуфінг в мережі? \nЯк ARP-спуфінг відрізняється від ARP-отруєння?&nbsp;",
      "value": "Моніторинг ARP-трафіку та виявлення аномалій"
   },
   {
      "name": "Як можна захистити мережу від ARP-спуфінгу за допомогою налаштувань маршрутизатора?",
      "value": "Включити відслідковування зміни IP-адрес в ARP-таблиці"
   },
   {
      "name": "Як можна обмежити можливість виконання ARP-спуфінгу?",
      "value": "Використовуючи аутентифікацію по MAC-адресу та моніторинг ARP-трафіку"
   },
   {
      "name": "Як називається другий етап алгоритму Диффі — Хеллмана, під час якого сторони обчислюють спільний секретний ключ?",
      "value": "Етап узгодження ключів"
   },
   {
      "name": "Як називається перший етап алгоритму Диффі — Хеллмана, під час якого сторони обмінюються публічними ключами?",
      "value": "Етап обміну ключами"
   },
   {
      "name": "Які властивості алгоритму Диффі — Хеллмана роблять його важливим для застосування в криптографії?",
      "value": "Можливість узгодження секретного ключа через відкритий канал"
   },
   {
      "name": "Які заходи безпеки можна вжити для захисту від ARP-спуфінгу?",
      "value": "Моніторинг ARP-таблиць"
   },
   {
      "name": "Які методи можуть використовувати етичні хакери для тестування безпеки системи?",
      "value": "Використання спеціальних програм для ідентифікації вразливостей системи."
   },
   {
      "name": "Які методи шифрування використовуються для захисту даних?",
      "value": "Шифрування симетричними та асиметричними алгоритмами."
   },
   {
      "name": "Які можливі наслідки ARP-спуфінгу для користувачів мережі?",
      "value": "Крадіжка конфіденційної інформації"
   },
   {
      "name": "Які можливі наслідки ARP-спуфінгу для мережевої безпеки?",
      "value": "Перехоплення конфіденційної інформації"
   },
   {
      "name": "Які можливості аналізу трафіку доступні у Wireshark?",
      "value": "Аналіз пакетів, статистика мережі, графіки процесу передачі даних"
   },
   {
      "name": "Які основні інструменти використовують етичні хакери під час аналізу системи?",
      "value": "Спеціалізовані програми для сканування вразливостей."
   },
   {
      "name": "Які основні етапи виконання етичного хакінгу?",
      "value": "Рекогносцировка, сканування, здобуття доступу, збереження доступу."
   },
   {
      "name": "Які основні етичні принципи повинен враховувати етичний хакер під час виконання своєї роботи?&nbsp;",
      "value": "Професійна доброчесність та справедливість."
   },
   {
      "name": "Які основні моральні принципи, якими повинні керуватися етичні хакери?",
      "value": "Не допускати використання отриманої інформації для особистих цілей."
   },
   {
      "name": "Які переваги має етичний хакінг?",
      "value": "Зменшення ризиків кібератак та підвищення рівня безпеки."
   },
   {
      "name": "Які правові аспекти пов'язані з етичним хакінгом?",
      "value": "Дії етичних хакерів мають законну підтримку та здійснюються за згодою власника системи."
   },
   {
      "name": "Які правові аспекти пов'язані з етичним хакінгом?",
      "value": "Дії етичних хакерів підтримуються законом та вимагають згоди власника системи."
   },
   {
      "name": "Які принципи лежать в основі безпеки алгоритму Диффі — Хеллмана?",
      "value": "Принципи асиметричного шифрування"
   },
   {
      "name": "Які типи аналізу можна виконати за допомогою Wireshark?",
      "value": "Аналіз мережевого трафіку, включаючи протоколи, адреси, та дані пакетів"
   },
   {
      "name": "Які типи мережевого трафіку можуть бути перенаправлені або перехоплені з використанням ARP-спуфінгу?",
      "value": "Будь-який мережевий трафік, включаючи паролі, електронну пошту, дані браузера тощо"
   },
   {
      "name": "Яка з наступних IP-адрес є адресою в межах підмережі?",
      "value": "192.168.1.1/24"
   },
   {
      "name": "Яка з наступних IP-адрес є адресою в межах приватної IP-адресної області?",
      "value": "192.168.1.100"
   },
   {
      "name": "Яка з наступних IP-адрес є адресою класу С?",
      "value": "192.168.1.1"
   },
   {
      "name": "Яка з наступних IP-адрес є коректною?",
      "value": "192.168.0.100"
   },
   {
      "name": "Яка заявлена особливість квантового шифрування?",
      "value": "Підвищена стійкість до атак з використанням квантових обчислень."
   },
   {
      "name": "Яка операційна система підтримує Wireshark?",
      "value": "Windows, macOS, та Linux"
   },
   {
      "name": "Яка опція Wireshark використовується для збереження захопленого мережевого трафіку?",
      "value": "Save As"
   },
   {
      "name": "Яка основна мета алгоритму Диффі — Хеллмана?",
      "value": "Узгодження спільного секретного ключа через відкритий канал зв'язку"
   },
   {
      "name": "Яка основна мета використання ARP-спуфінгу в атаках на мережі?",
      "value": "Отримання несанкціонованого доступу до мережі"
   },
   {
      "name": "Яка основна перевага асиметричного шифрування над симетричним?",
      "value": "Більша безпека при передачі ключів."
   },
   {
      "name": "Яке призначення програми VirtualBox?",
      "value": "Для створення віртуальних машин."
   },
   {
      "name": "Який інструмент часто використовується для виконання ARP-спуфінгу?",
      "value": "Ettercap"
   },
   {
      "name": "Який з варіантів використовується для узгодження секретного ключа в алгоритмі Диффі — Хеллмана?",
      "value": "Публічний ключ"
   },
   {
      "name": "Який з перерахованих алгоритмів є симетричним?",
      "value": "AES"
   },
   {
      "name": "Який ключ використовується для шифрування в асиметричному шифруванні?",
      "value": "Відкритий ключ"
   },
   {
      "name": "Який протокол Wireshark використовує для захоплення мережевого трафіку?",
      "value": "PCAP"
   },
   {
      "name": "Яким чином алгоритм Диффі — Хеллмана допомагає у безпеці мережевого зв'язку?",
      "value": "Забезпечує конфіденційність та цілісність передачі даних через відкриті канали зв'язку"
   },
   {
      "name": "Яким чином атакуючий може виконати ARP-спуфінг?",
      "value": "Відправляючи піддельні ARP-відповіді"
   },
   {
      "name": "Яким чином етичний хакінг відрізняється від неетичного?",
      "value": "Етичний хакінг має на меті покращення безпеки, в той час як неетичний хакінг ставить за мету заволодіння інформацією."
   },
   {
      "name": "Яким чином етичний хакінг впливає на репутацію компаній та організацій?",
      "value": "Поліпшує репутацію, показуючи, що організація приділяє увагу безпеці та реагує на виявлені вразливості."
   },
   {
      "name": "Яким чином етичний хакер може співпрацювати з власником системи?",
      "value": "Передача всіх знайдених вразливостей власнику системи для їх виправлення."
   },
   {
      "name": "Яким чином можна використовувати ARP-спуфінг для збільшення швидкості мережевого з'єднання?",
      "value": "Реадресацією мережевого трафіку від інших пристроїв до атакуючого"
   },
   {
      "name": "Якими можуть бути наслідки використання неетичного хакінгу порівняно з етичним?",
      "value": "Етичний хакінг може сприяти збільшенню безпеки, тоді як неетичний може призвести до порушення конфіденційності та збитків."
   },
    {
      "name": "1.Що означає термін \"фронтенд розробка\"?",
      "value": "Створення інтерфейсу користувача веб-сайтів та додатків."
   },
   {
      "name": "10. Що таке API і для чого воно використовується в програмуванні та розробці програм?",
      "value": "Набір інструментів та правил, які дозволяють програмам взаємодіяти між собою."
   },
   {
      "name": "11. Які з перерахованих фреймворків є найпопулярнішими на даний момент для розробки веб-інтерфейсів?",
      "value": "Усі відповіді вірні"
   },
   {
      "name": "12. Що таке React і для чого його використовують?",
      "value": "JavaScript-бібліотека для побудови інтерфейсів користувачів."
   },
   {
      "name": "13.Які основні переваги використання React при створенні графічних веб-інтерфейсів?",
      "value": "Ефективне управління станом і пере-рендеринг компонентів."
   },
   {
      "name": "14.Що таке JSX в реактивному програмуванні?",
      "value": "Розширення JavaScript для опису інтерфейсу користувача."
   },
   {
      "name": "15. Що означає термін \"синтаксичний цукор\" в програмуванні?",
      "value": "Спрощений або зручний синтаксис, який полегшує написання коду."
   },
   {
      "name": "16. Що таке JSON?",
      "value": "Формат обміну даними, що використовується для передачі структурованих даних."
   },
   {
      "name": "17. Для чого в веб-розробці використовують JWT (JSON Web Token)?",
      "value": "Для безпечної передачі інформації між клієнтом та сервером у вигляді токенів."
   },
   {
      "name": "18. Які проблеми розв'язує TypeScript (TS) в веб-розробці?",
      "value": "Забезпечення безпеки типів і виявлення помилок на етапі розробки."
   },
   {
      "name": "19. Що таке state в React?",
      "value": "Динамічний об'єкт, який зберігає дані та визначає стан компонента."
   },
   {
      "name": "20. Що таке \"props\" в React?",
      "value": "Динамічний об'єкт, який використовується для передачі даних в компонент з його батьківського компонента."
   },
   {
      "name": "21.При яких умовах відбудеться ререндер компонента в React?",
      "value": "При зміні стану (state) або властивостей (props) компонента."
   },
   {
      "name": "22.Що таке \"хуки\" (Hooks) в React?",
      "value": "Функції, які дозволяють використовувати стан та інші функціональності React в функціональних компонентах."
   },
   {
      "name": "23.Яку проблему розв'язує глобальний менеджер стану в React?",
      "value": "Керування та зберіганням стану, який використовується багатьма компонентами на різних рівнях відділень."
   },
   {
      "name": "24.Що таке \"умовний рендеринг\" в React?",
      "value": "Механізм, що визначає, чи відбувається рендеринг компонента на основі визначених умов."
   },
   {
      "name": "25.Що таке CSS препроцесори?",
      "value": "Мови, які розширюють стандартний CSS, дозволяючи використовувати змінні, вкладені стилі та інші функціональності."
   },
   {
      "name": "26.Що таке localStorage, sessionStorage та cookie в контексті веб-розробки?",
      "value": "Механізми збереження даних на клієнтському боці для веб-додатків."
   },
   {
      "name": "27.Який заголовок зазвичай встановлюється в запитах при використанні JWT (JSON Web Token)?",
      "value": "Authorization"
   },
   {
      "name": "28. Що означає \"undefined\" в програмуванні?",
      "value": "Вказує на відсутність даних або відсутність значення змінної."
   },
   {
      "name": "29. Що означає \"callback\" в програмуванні?",
      "value": "Функція, яка передається іншій функції в якості аргументу і викликається після завершення певної операції."
   },
   {
      "name": "3.Для чого необхідна семантична верстка в контексті веб-розробки?",
      "value": "Передача значущості елементів сторінки для покращення доступності та SEO оптимізації."
   },
   {
      "name": "30.Що таке Node.js?",
      "value": "Серверна технологія, яка використовує JavaScript для виконання коду на стороні сервера."
   },
   {
      "name": "31. Які оператори порівняння існують в JavaScript?",
      "value": "та !"
   },
   {
      "name": "32. Чим відрізняється оператор == від === в JavaScript?",
      "value": "“"
   },
   {
      "name": "33. Що означає термін \"компонент\" в React?",
      "value": "Частина коду, яку використовують для відображення інтерфейсу користувача та яка може бути повторно використана."
   },
   {
      "name": "34.Що означає термін \"інтерфейс\" в TypeScript?",
      "value": "Специфікація, яка визначає контракти для структур даних та функцій."
   },
   {
      "name": "35. Що означає термін \"Enum\" в контексті TypeScript?",
      "value": "Спеціальний об'єкт, який зберігає групу констант."
   },
   {
      "name": "36.Який елемент використовується для створення посилань у HTML?",
      "value": "<a>"
   },
   {
      "name": "37.Які з цих мов ставляться до фронтенд-технологіям?",
      "value": "JavaScript"
   },
   {
      "name": "38. Чим є веб-сторінка в архітектурі MVC?",
      "value": "Поданням (View)"
   },
   {
      "name": "39. Що з наведеного нижче НЕ є фреймворком/бібліотекою для побудови фронтенд-додатка?",
      "value": "Elem.js"
   },
   {
      "name": "4.Які теги вважаються семантичними в HTML? \n5.Що означає абревіатура CSS і для чого використовується цей технологічний засіб? {\n~ Central Style System - використовується для збереження стилів у центральному сховищі.\n~ Computer Style Sheets - служить для створення стилів для різних комп'ютерів.\n= Cascading Style Sheets - використовується для задання вигляду та форматування веб-сторінок.\n~ Creative Styling System - використовується для творчого оформлення вмісту в Інтернеті.\n}",
      "value": "<nav>, <section>, <article>"
   },
   {
      "name": "40. Що таке SPA (Single Page Application)?",
      "value": "Ця програма, яка складається з однієї веб-сторінки, що завантажується повністю при першому запиті користувача."
   },
   {
      "name": "41. Що означає MPA (Multi-Page Application)?",
      "value": "Ця програма має кілька веб-сторінок, кожна з яких завантажується окремо при переході користувача."
   },
   {
      "name": "42. Поставлено завдання написати адмін-панель з можливістю підтримки користувачів через вбудований чат, яку технологію рендерингу варто вибрати програмісту?",
      "value": "SPA"
   },
   {
      "name": "43. Поставлено завдання написати сайт-візитку, який має добре індексуватися пошуковими системами для просування, яку технологію рендерингу НЕ варто обирати програмісту?",
      "value": "SPA"
   },
   {
      "name": "44. Що таке локальний стан React?",
      "value": "Цей стан зберігається всередині компонента і не залежить від інших компонентів."
   },
   {
      "name": "45. Що з наведеного нижче НЕ є глобальним станом веб-програми React?",
      "value": "Стан вибору checkbox-компонента"
   },
   {
      "name": "46. При спробі зробити запит із фронтенд-додатка на бекенд-сервер – запит відхиляється з повідомленням про CORS помилку. Що ви як фронтенд-розробник можете зробити, щоб виправити цю помилку?",
      "value": "Сказати про помилку бекенд-розробнику"
   },
   {
      "name": "47. Що таке typescript? \n48. Які проблеми JavaScript НЕ можна вирішити за допомогою TypeScript? {\n~ Неявні помилки типів, як-от передача неправильних аргументів функції.\n~ Відсутність статичної типізації JavaScript.\n= Проблеми, пов'язані з асинхронним кодом, такі як коллбеки та обіцянки (promises).\n~ Проблеми, пов'язані з динамічною типізацією.\n}",
      "value": "Це мова програмування, яка додає синтаксис для типів JavaScript."
   },
   {
      "name": "49. Що таке автентифікація користувача?",
      "value": "Це процес автентифікації користувача, щоб переконатися, що він має право отримати доступ до певних ресурсів або функціональності."
   },
   {
      "name": "50. Що таке авторизація користувача?",
      "value": "Це процес визначення ролі користувача у системі."
   },
   {
      "name": "51. Junior-програміст у компанії PeaceData Раджніш Хутрапалі вирішив закодувати в JWT-токен для автентифікації користувача додатково його домашню адресу та номер телефону. Чому це погана ідея?",
      "value": "Токен не шифрується, через що ця особиста інформація може бути легко перехоплена"
   },
   {
      "name": "52. Що таке UI-бібліотека у React?",
      "value": "Це набір готових компонентів і стилів, призначених для створення інтерфейсу користувача (UI) в додатках на React."
   },
   {
      "name": "53. Яку проблему НЕ може вирішити UI-бібліотека у React?",
      "value": "Робота з UX"
   },
   {
      "name": "54. Що є прикладом \"Моделі\" (Model) в архітектурі MVC у бекенд-додатку?",
      "value": "Data Access Object (DAO)"
   },
   {
      "name": "55. Що таке ORM у контексті бекенд-додатку?",
      "value": "Object-Relational Mapping (ORM): Це техніка, яка дозволяє розробникам взаємодіяти з базами даних із використанням об'єктно-орієнтованих підходів."
   },
   {
      "name": "56. Що таке REST?",
      "value": "Стиль архітектури програмного забезпечення"
   },
   {
      "name": "57. Який метод HTTP використовується для видалення ресурсу?",
      "value": "DELETE"
   },
   {
      "name": "58. Навіщо бекенду докладання онлайн-банкінгу може знадобитися впроваджувати аутентифікацію/авторизацію?",
      "value": "Для забезпечення безпеки даних користувача та запобігання несанкціонованому доступу"
   },
   {
      "name": "59. Що таке хешування та для чого використовується?",
      "value": "Хешування - це процес перетворення даних на унікальний код, який використовується для забезпечення безпеки даних"
   },
   {
      "name": "6.Що означає термін \"адаптивна верстка\"?",
      "value": "Спроектована таким чином, щоб коректно відображатися на різних пристроях та розмірах екранів."
   },
   {
      "name": "60. Що таке шифрування і навіщо використовується?",
      "value": "Шифрування - це процес перетворення даних на код, який можна прочитати тільки за допомогою спеціального ключа, і використовується для захисту конфіденційності даних"
   },
   {
      "name": "61. Чим відрізняється хешування даних від шифрування даних?",
      "value": "Хешування перетворює дані в унікальний код, який не може бути перетворений назад, в той час як шифрування перетворює дані в код, який може бути дешифрований за допомогою спеціального ключа"
   },
   {
      "name": "62. Бекенд-розробник Василь – використовує хешування SHA-3 для хешування паролів користувачів. Сьогодні БД користувачів програми Василя вкрали хакери. Чи є в безпеці паролі користувачів?",
      "value": "Так, якщо Василь використовував сіль"
   },
   {
      "name": "63. Що таке сіль у хешуванні і навіщо ми її застосовуємо?",
      "value": "Сіль - це випадкове значення, яке додається до даних перед хешуванням для збільшення складності злому хешу"
   },
   {
      "name": "64. Чи може REST API додаток сам ініціювати підключення до клієнта?",
      "value": "Ні, REST API додаток не може сам ініціювати підключення до клієнта, так як він працює за принципом запит-відповідь"
   },
   {
      "name": "65. Чим є ендпоінт в архітектурі MVC?",
      "value": "Контролер (Controller)"
   },
   {
      "name": "66. Що таке автентифікаційні cookie?",
      "value": "Аутентифікаційні cookie - це файли, які зберігають інформацію про користувача та використовуються для підтвердження його ідентичності при повторному відвідуванні сайту"
   },
   {
      "name": "67. Що таке JWT?",
      "value": "JWT (JSON Web Token) - це відкритий стандарт (RFC 7519) для безпечної передачі між двома сторонами як JSON об'єкта"
   },
   {
      "name": "68. Що з наведеного нижче НЕ є перевагою JWT перед cookie?",
      "value": "JWT можна використовувати для відстеження поведінки користувача на веб-сайті"
   },
   {
      "name": "7.Які механізми використовуються для реалізації адаптивної верстки в веб-розробці?",
      "value": "Media Queries для адаптації стилів до розмірів екрану."
   },
   {
      "name": "8.Яким чином вирішуються конфлікти стилів в CSS?",
      "value": "Застосування селекторів із більшою специфічністю."
   },
   {
      "name": "9.Що означає термін \"DOM-дерево\"?",
      "value": "Модель об'єктів документа, яка представляє структуру HTML-сторінки у вигляді ієрархічного дерева об'єктів."
   },
   {
      "name": "2.Що означає абревіатура HTML у контексті веб-розробки?",
      "value": "Hyper Transfer Markup Language.\nHigh-Level Text Manipulation Language."
   },
    {
      "name": "165. Справа про адміністративне правопорушення, передбачене статтею 185-7 КУпАП, розглядається:",
      "value": "у триденний строк"
   },
   {
      "name": "3 якого віку настає відповідальність за злісну непокору законному розпорядженнюабо вимозі поліцейського:",
      "value": "з 16 років"
   },
   {
      "name": "3 якого віку настає відповідальність за злісну непокору законному розпорядженню або вимозі поліцейського:",
      "value": "з 16 років"
   },
   {
      "name": "3 якого віку настає відповідальність фізичних осіб за вчинення правопорушень, що посягають на здійснення народного волевиявлення:",
      "value": "з 16 років"
   },
   {
      "name": "38. Якщо особа оспорює факт вчинення правопорушення, поліцейський:",
      "value": "складає протокол про адміністративне правопорушення"
   },
   {
      "name": "Іноземці і особи без громадянства, які перебувають на території України, підлягають адміністративній відповідальності:",
      "value": "на загальних підставах з громадянами України"
   },
   {
      "name": "Інтереси особи, яка притягається до адміністративної відповідальності, які є неповнолітніми особами:",
      "value": "мають право представляти їх  законні представники батьки, опікуни, піклувальники"
   },
   {
      "name": "Адміністративна відповідальність настає за наявністю таких підстав:",
      "value": "нормативних, фактичних, документальних"
   },
   {
      "name": "Адміністративне затримання особи може бути застосовано поліцією до правопорушника, який вчинив:",
      "value": "правопорушення, які зазначені у статті 262 КУпАП"
   },
   {
      "name": "Адміністративне затримання особи, яка вчинила дрібне хуліганство, може тривати не більш як?",
      "value": "3 години"
   },
   {
      "name": "Адміністративне затримання особи, яка не виконала законне розпорядження або вимогу поліцейського, може тривати не більш:",
      "value": "3 годин"
   },
   {
      "name": "Адміністративне затримання особи, яка не виконала законне розпорядженняабо вимогу поліцейського, може тривати не більш:",
      "value": "3 години"
   },
   {
      "name": "Адміністративне правопорушення за статтею 178 КУпАП посягає на:",
      "value": "громадський порядок, людську гідність та громадську мораль"
   },
   {
      "name": "Адміністративне стягнення за вчинення адміністративного правопорушення за ознаками ст. 51 КУпАП може бути накладено не пізніш як через:",
      "value": "три місяціз дня вчинення правопорушення"
   },
   {
      "name": "Адміністративне стягнення за зайняття проституцією накладається:",
      "value": "адміністративною комісією"
   },
   {
      "name": "Адміністративне стягнення за правопорушення, яке віднесено до компетенції Національної поліції може бути накладено:",
      "value": "не пізніш як через два місяці з дня вчинення правопорушення, а при триваючому правопорушенні - не пізніш як через два місяці з дня його виявлення"
   },
   {
      "name": "Адміністративним правопорушенням (проступком) визнається протиправна, винна (умисна або необережн дія чи бездіяльність:",
      "value": "за яку законом передбачено адміністративну відповідальність"
   },
   {
      "name": "Адміністративну відповідальність за правопорушення у сфері забезпечення безпеки дорожнього руху, зафіксовані в автоматичному режимі:",
      "value": "несуть юридичні та фізичні особи, за якими зареєстровано транспортний засіб"
   },
   {
      "name": "В який строк розглядається справа про адміністративне правопорушення за статтею 174 КУпАП:",
      "value": "у п'ятнадпятиденний строк"
   },
   {
      "name": "В якому процесуальному документі фіксується застосування заходу забезпечення провадження:",
      "value": "протокол про адміністративне затримання"
   },
   {
      "name": "Відповідно до КУпАП крайня необхідність це:",
      "value": "обставина, що виключає адміністративну відповідальність"
   },
   {
      "name": "Визначте невеликий розмір наркотичного засобу \"канабіс\" (цілі або різного ступеня подрібнення будь-які частини рослини роду коноплі або їх суміш):",
      "value": "до 5 гр."
   },
   {
      "name": "Визначте обставини, які обтяжують відповідальність за вчинення правопорушенняпередбаченого статтею 180 (Доведення неповнолітнього до стану сп'яніння):",
      "value": "- усі відповіді вірні"
   },
   {
      "name": "Визначте строк розгляду скарги на постанову по справі про адміністративне правопорушення:",
      "value": "протягом  десяти днів з дня винесення постанови"
   },
   {
      "name": "Визначте строк розгляду справ про адміністративні правопорушення передбачені ст. 51 КУпАП:",
      "value": "у п'ятиденний строк"
   },
   {
      "name": "Визначте суб'єкта адміністративної відповідальності за статтею 180-1 КУпАП:",
      "value": "посадові особи закладу незалежно від форми власності або громадяни - власники закладу чи уповноважені ними особи"
   },
   {
      "name": "Для відбиття нападу та знешкодження тварин допускається використання:",
      "value": "пристроїв для відстрілу патронів, споряджених гумовими чи аналогічними за своїми властивостями метальними снарядами несмертельної дії, електрошокерів"
   },
   {
      "name": "Для проведення передвиборної агітації законом забороняється:",
      "value": "використання приміщень органів державної впали та органів місцевого самоврядування"
   },
   {
      "name": "Для того щоб правопорушення могло були кваліфіковане, як дрібне викрадення чужого майна у 2021, сумма викраденого майна не повинна перевищувати?",
      "value": "227,00 грн."
   },
   {
      "name": "До адміиістративних правопорушень з матеріальним складом належать:",
      "value": "міститься така ознака, як настання шкідливих матеріальних наслідків діяння"
   },
   {
      "name": "До елементів юридичного складу адміністративного правопорушення належать:",
      "value": "об'єкт, об'єктивна сторона, суб'єкт, суб'єктивна сторона"
   },
   {
      "name": "До обов'язкових ознак об'єктивної сторони адміністративного правопорушення належить:",
      "value": "противоправне діяння (дія чи бездіяльність)"
   },
   {
      "name": "Дозвільна система, що здійснюється органами внутрішніх справ, не поширюється на:",
      "value": "електронну зброю"
   },
   {
      "name": "Документ шо засвідчує факт створення або припинення юридичної особи, набуття або позбавлення статусу підприємця фізичною особою, відсутність якого є складом статті 164 КУпАП, є:",
      "value": "- виписка з Єдиного державного реєстру"
   },
   {
      "name": "Доставления порушника має бути проведено в такі строки:",
      "value": "не більше 1-ї години"
   },
   {
      "name": "</i>Доставлення порушника застосовується працівником поліції з метою:",
      "value": "сладення протоколу про адміністративне правопорушення в разі неможливості скласти його на місці вчинення правопорушення, якщо складення протоколу є обов'язковим."
   },
   {
      "name": "Дрібне викрадення чужого майна здійснюється шляхом:",
      "value": "крадіжки, шахрайства, привласнення чи розтрати"
   },
   {
      "name": "З якого віку настає відповідальність за вчинення правопорушення передбаченого ст. 173-2:",
      "value": "з 16 років"
   },
   {
      "name": "З якого віку настає відповідальність за куріння у заборонених місцях:",
      "value": "з 16 років"
   },
   {
      "name": "З якого віку настає відповідальність за незаконне виробництво, придбання, зберігання, перевезення, пересилання наркотичних засобів або психотропних речовин без мети збуту в невеликих розмірах:",
      "value": "16 років"
   },
   {
      "name": "З якого віку настає відповідальність за порушення правил тримання собак і котів:",
      "value": "з 16 років"
   },
   {
      "name": "За вчинення яких адміністративних правопорушень, передбачено адміністративне затримання:",
      "value": "дрібне хуліганство"
   },
   {
      "name": "За незаконний посів або незаконне вирощування снотворного маку чи конопель настає відповідальність за:",
      "value": "ст. 106-2 КУпАП"
   },
   {
      "name": "За порушення правил, норм і стандартів, що стосується забезпечення безпеки дорожнього руху військовослужбовці, військовозобов'язані та резервісти під час проходження зборів, а також особи Національної поліції:",
      "value": "несуть адміністративну відповідальність на загальних підставах"
   },
   {
      "name": "За продаж товарів зі складів, баз, підсобних приміщень підприємств на порушення встановлених правил, а так само приховування товарів від покупціввстановлюєтьсяадміністративна відповідальність:",
      "value": "ч.2 статті 155 КУпАП"
   },
   {
      "name": "За результатами розгляду справи про адміністративне правопорушення поліцейськими приймається рішення:",
      "value": "виноситься постанова про накладення адміністративного стягнення"
   },
   {
      "name": "За якою статтею КУпАП настає відповідальність за придбання, зберігання,перевезення наркотичних засобів або психотропних речовин без мети збуту в невеликих розмірах:",
      "value": "ст. 44"
   },
   {
      "name": "Заходи впливу щодо неповнолітніх осіб, які визначені у статті 24-1 КУпАП можуть застосовуватись:",
      "value": "виключно судом"
   },
   {
      "name": "Знаходження в розважальних та ресторанних закладах неповнолітнім в нічний час без супроводу батьків або інших законних представників забороняється:",
      "value": "особам, які не досягли 16 років"
   },
   {
      "name": "Ліцензії на право роздрібної торгівлі алкогольними напоями і тютюновими виробами видаються на:",
      "value": "на один рік"
   },
   {
      "name": "Місцями для стрільби з вогнепальної чи холодної метальної зброї, пристроїв для відстрілу патронів в населених пунктах є:",
      "value": "тири, стрільбиша, мисливські угіддя"
   },
   {
      "name": "На який строк може бути затримано особа за скоєння дрібного викрадення чужого майна?",
      "value": "до 3 годин"
   },
   {
      "name": "Не відноситься до завдань поліції  під час здійснення народного волевиявлення:",
      "value": "охорона та супровід  членів виборчої дільниці на час виборів"
   },
   {
      "name": "Не дозволяється приводити тварин до об'єктів господарського харчування у приміщення магазинів і кафе окрім:",
      "value": "собак - поводарів"
   },
   {
      "name": "Неповнолітній може бути притягнутий до адміністративної відповідальності за порушення правил торгівлі:",
      "value": "за статтею 155 КУпАП на підставі статті 24-1 КУпАП"
   },
   {
      "name": "Об'єктивну сторону правопорушення передбаченого статтею 181 КУпАП, становлять:",
      "value": "ворожіння на будь-чому у громадських місцях за винагороду"
   },
   {
      "name": "Об'єктивну сторону правопорушення, передбаченого статтею 180 КУпАП становлять:",
      "value": "сам факт доведенн неповнолітнього до стану сп'яніння повнолітньою особою"
   },
   {
      "name": "Об'єктом дрібного хуліганства є:",
      "value": "нецензурна лайка в громадських місцях, образливе чіпляння до громадян і інші подібні дії. що порушують громадський порядок і спокій громадян"
   },
   {
      "name": "Об'сктнвною стороною правопорушення за статтею 173-1 КУпАП передбачено діяння:",
      "value": "поширювання неправдивих чуток про замінування залізничного вокзалу"
   },
   {
      "name": "Обовязковою ознакою об'єктивної сторони правопорушення, яке кваліфікується за статтею 181-1 КУпАП, є:",
      "value": "винагорода за надання сексуальних послуг"
   },
   {
      "name": "Органи місцевого самоврядування в межах відповідної адміністративної території на підставі закону:",
      "value": "мають право заборонити або обмежити споживання пива (крім пива у пластиковій тарі), алкогольних, слабоалкогольних напоїв, вин столових та куріння тютюнових виробів під час проведення масових заходів"
   },
   {
      "name": "Осіб, які порушили правили обігу наркотичних засобів і психотропних речовин, може бути затримано:",
      "value": "на строк до трьох годин для складення протоколу, а в необхідних випадках для встановлення особи, проведения медичного огляду, з'ясування обставин придбання вилучених наркотичних засобів і психотропних речовин та їх дослідження - до трьох діб з повідомленням про це письмово прокурора протягом двадцяти чотирьох годин з моменту затримання"
   },
   {
      "name": "Особистий огляд правопорушника відповідно до статті 264 КУпАП:",
      "value": "проводиться уповноваженою на те посадовою особою однієї статі з оглядуваним і в присутності двох понятих тієї самої статі"
   },
   {
      "name": "Під час вигулу супроводжувати собаку може особа, яка досягла:",
      "value": "14-річного віку"
   },
   {
      "name": "Під час проведення масових заходів за статтею 185-7 КУпАП кваліфікується протиправні діяння:",
      "value": "поширення завідомо неправдивих відомостей з метою провокації і злісної непокори законній вимозі поліцейського"
   },
   {
      "name": "Патрульні наряди при виконані своїх завдань з охорони громадського порядку повинні вживати заходів до захисту від противоправних посягань:",
      "value": "державної, комунальної, приватної власності"
   },
   {
      "name": "Перебування доставленої особа за вчинення дрібного хуліганства у штабі громадського формування може тривати:",
      "value": "- не більше 1 години"
   },
   {
      "name": "Перебування доставленої особи у штабі громадського формування з охорони громадського порядку чи громадському пункі з охорони громадського порядку:",
      "value": "не може тривати більш як одну годину"
   },
   {
      "name": "Передвиборна агітація закінчується:",
      "value": "о 24 годині останьої п'ятниці перед  днем виборів"
   },
   {
      "name": "Передвиборна агітація розпочинається з моменту:",
      "value": "прийняття ЦВК рішення про реєстрацію кандидатів у народні депутати"
   },
   {
      "name": "Перелік місць, в яких заборонено споживання пива (крім безалкогольного), алкогольних та слабоалкогольних напоїв, вин столових визначається:",
      "value": "законодавчим актом та рішенням органів місцевого самоврядування"
   },
   {
      "name": "Поліцейський зобов'язаний при складанні протоколу про адміністративне правопорушення роз'яснити особі його права, передбачені статтею 63 Конституції України. Про що йдеться в цій статті Конституції України?",
      "value": "Особа не несе відповідальності за відмову давати показання або пояснення щодо себе, членів сім'ї чи близьких родичів"
   },
   {
      "name": "Поліцейський зобов'язаний при складанні протоколу про адміністративне правопорушення роз'яснити особі його права, передбачені статтею 55 Конституції України. Про що йдеться в цій статті Конституції України?",
      "value": "Кожному гарантується право на оскарження в суді рішень, дій чи бездіяльності органів державної влади, органів місцевого самоврядування, посадових і службових осіб"
   },
   {
      "name": "Поліцейський не має права накладати адміністративні стягнення на таких осіб:",
      "value": "осіб віком від 16 до 18 років"
   },
   {
      "name": "Поліцейським за крадіжку  з супермаркету вартістю 454 грн. затриманоособу.  До якого виду юридичної відповідальності вона може бути притягнута?",
      "value": "кримінальної"
   },
   {
      "name": "Поліцейським за крадіжку пляшки коньяку вартістю 220 грн. 10.01.2021 року затриманий військовослужбовець Зброїних Сил України. До якого виду юридичної відповідальності він може бути притягнутий?",
      "value": "дисциплінарної"
   },
   {
      "name": "Постанова по справі про адміністративне правопорушення оголошується:",
      "value": "негайно після закінчення розгляду справи"
   },
   {
      "name": "Потерпілим є особа, якій адміністративним правопорушенням заподіяно моральну, фізичну або майнову шкоду. Статус потерпілого визначається статтею 269 КУпАП. Одночасно:",
      "value": "потерпілого може бути опитано як свідка відповідно до статті 272 КУпАП"
   },
   {
      "name": "Предмет посягання відповідно до ст. 51 КУпАП:",
      "value": "будь-яке майно"
   },
   {
      "name": "При вилученні предметів торгівлі у невстановлених місцях складається:",
      "value": "відмітки про вилучення вносяться до протоколу про адміністративне правопорушення"
   },
   {
      "name": "При виявленні фактів знаходження в розважальних та ресторанних закладахнеповнолітнього в нічний час без супроводу батьків або інших законнихпредставниківполіцейським складається протокол про адміністративне правопорушення на:",
      "value": "посадових осіб закладу незалежно від форми власності або громадян - власників закладу чи уповноважених ними осіб"
   },
   {
      "name": "При розгляді справ про адміністративні правопорушення, передбачені статтями 51 (дрібне викрадення чужого майн, 173 (дрібне хуліганство) КУпАП:",
      "value": "присутність особи, яка притягається до адміністративної відповідальності  є обов'язковою"
   },
   {
      "name": "Притягнення до адміністративної відповідальності можливо:",
      "value": "тільки в результаті вчинення адміністративного проступку"
   },
   {
      "name": "Про адміністративне затримання:",
      "value": "складається протокол"
   },
   {
      "name": "Про місце перебування особи, затриманої за вчинення адміністративного правопорушення:",
      "value": "негайно повідомляються її родичі, а на її прохання також власник відповідного підприємства, установи, організації або уповноважений ним орган"
   },
   {
      "name": "Про накладення якого адміністративного стягнення може прийняти рішення офіцер поліції:",
      "value": "штраф"
   },
   {
      "name": "Про проведения особистою огляду й огляду речей:",
      "value": "складається протокол або про це робиться відповідний запис у протоколі про адміністративне правопорушення чи в протоколі про адміністративне затримання"
   },
   {
      "name": "Проведення ремонтних робіт, що супроводжуються шумом, забороняється у робочі дні:",
      "value": "з 21-00 до 8-00 години"
   },
   {
      "name": "Продавець алкогольних напоїв або тютюнових виробів, з метою встановлення віку покупця,має право:",
      "value": "- вимагати у покупця, який купує алкогольні напої або тютюнові вироби паспортний документ"
   },
   {
      "name": "Протокол про адміністративне затримання:",
      "value": "підписується посадовою особою, яка його склала і затриманим<i>"
   },
   {
      "name": "Протокол про адміністративне правопорушення є недійсним без підпису:",
      "value": "поліцейського"
   },
   {
      "name": "Протокол про адміністративне правопорушення віднесено до:",
      "value": "документальних підстав адміністративної відповідальності"
   },
   {
      "name": "Протокол про адміністративне правопорушення передбачене ст. 51 КУпАП розглядається за місцем:",
      "value": "вчинення правопорушення"
   },
   {
      "name": "Протокол про адміністративне правопорушення передбачене статтею 106-1 КУпАП складається:",
      "value": "у двох примірниках"
   },
   {
      "name": "Протоколи про правопорушення, передбачені статтею 173-2 розглядають:",
      "value": "районні, районі у місті, міські чи міськрайоні суди (судді)"
   },
   {
      "name": "Процесуальним документом про факт вчинення діяння, містить ознаки правопорушення, передбаченого КУпАП, є:",
      "value": "протокол"
   },
   {
      "name": "Санкція ч.2 статті 154 КУпАП передбачає:",
      "value": "штраф с конфіскацією тварини"
   },
   {
      "name": "Серед зазначених заходів знайти захід, який не відноситься до заходів забезпечення провадження:",
      "value": "доставлення правопорушника"
   },
   {
      "name": "Серед перерахованих заходів НЕ є заходами забезпеченим провадженим в справах про адміністративні правопорушення:",
      "value": "застосування засобів примусової зупинки транспортного засобу"
   },
   {
      "name": "Скаргу на постанову по справі про адміністративне і правопорушення може бути подано протягом:",
      "value": "десяти днів з дня винесення постанови"
   },
   {
      "name": "Складом правопорушення, передбаченого статтею 160 КУпАП, є:",
      "value": "торгівля у невстановлених місцях"
   },
   {
      "name": "Справа про адміністративне правопорушення за статтею 180-1 КУпАП розглядається:",
      "value": "у п'ятнадцятиденний строк"
   },
   {
      "name": "Справа про адміністративне правопорушення за статтею 185 КУпАП розглядається:",
      "value": "протягом доби"
   },
   {
      "name": "Справа про адміністративне правопорушення за статтею 185 КУпАП розглядається:",
      "value": "протягом доби"
   },
   {
      "name": "Справа про адміністративне правопорушення передбачене статтею 173 КУпАП розглядається:",
      "value": "- протягом доби"
   },
   {
      "name": "Справа про адміністративне правопорушення передбачене статтею 44 КУпАП розглядається:",
      "value": "за місцем вчинення правопорушення"
   },
   {
      "name": "Справа про адміністративне правопорушення, передбачене статтею 185-7 КУпАП, розглядається:",
      "value": "протягом доби"
   },
   {
      "name": "Справа про торгівлю з рук у невстановлених місцях розглядається:",
      "value": "судом у триденний строк"
   },
   {
      "name": "Справи про адміністративні правопорушення, що посягають на здійснення народного волевиявлення, розглядається:",
      "value": "судом"
   },
   {
      "name": "Справи про адміністративні правопорушення, що посягають на здійснення народного волевиявлення, розглядаються: _____\n28",
      "value": "в триденний строк"
   },
   {
      "name": "Справи про доведення неповнолітнього до стану сп'яніння (крім батьків неповнолітніх або осіб, які їх замінюють) розглядаються:",
      "value": "адміністративною комісією"
   },
   {
      "name": "Справу про адміністративне правопорушення щодо публічних закликів до невиконання розпоряджень або вимог поліцейського у зв'язку з виконанням ним обов'язків по охоронігромадського порядку розглядають:",
      "value": "суд"
   },
   {
      "name": "Справу про адміністративне правопорушення, передбачене статтею 185 КУпАП, розглядають:",
      "value": "суд"
   },
   {
      "name": "Строк адміністративного затримання обчислюється з моменту:",
      "value": "фактичного затримання особи"
   },
   {
      "name": "Строками про адміністративне правопорушення та статтею 173 КУпАП розглядається:",
      "value": "протягом доби"
   },
   {
      "name": "Суб'єктивна  сторона правопорушення вередбаченого ст. 51 КУпАП характеризується наявністю:",
      "value": "вини у формі прямого умислу"
   },
   {
      "name": "Суб'єктивна сторона адміністративного правопорушення характеризується:",
      "value": "виною, яка проявляється у формі умислу або необережності"
   },
   {
      "name": "Суб'єктом адміністративної відповідальності за ст. 174 КУпАП може бути особа:",
      "value": "яка досягла на момент вчинення адміністративного правопорушення 16-річного віку"
   },
   {
      "name": "Суб'єктом відповідальності за статтею 195 КУпАП є:",
      "value": "працівники підприємств, установ, організацій, відповідальні за охорону зброї та бойових припасів"
   },
   {
      "name": "Суб'єктом правопорушення, передбаченого статтею 180 КУпАП не можуть бути:",
      "value": "продавці, які продали неповнолітньому алкогольні напої"
   },
   {
      "name": "Термін адміністративного затримання за незаконне виробництво, придбання, зберігання, перевезення, пересилання наркотичних засобів або психотропних речовин без мети збуту в невеликих розмірах:",
      "value": "до 3-х діб"
   },
   {
      "name": "Тимчасове затримання транспортного засобу уповноваженою особам територіального, у тому числі міжрегіонального органу патрульної служби проводиться у випадках, передбачених статтею 265-2 КУпАП зокрема у разі:",
      "value": "коли неможливо усунути причину затримання на місці виявлення адміністративного правопорушення"
   },
   {
      "name": "У випадку, коли затриманий потребує медичної допомоги, зазначаються:",
      "value": "час її надання, номер бригади швидкої медичної допомоги, прізвище та ініціали лікаря, до якого закладу охорони здоров'я направлено затриманого"
   },
   {
      "name": "У разі виявлення  факту проведення  передвиборної  агітації в день виборів  або референдуму, поліцейський уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "У разі виявлення порушення правил вигулу домашніх тварин поліцейський уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд адміністративної комісії"
   },
   {
      "name": "У разі виявлення порушення правил торгівлі громадянами, які займаються  підприємницькою діяльністю, працівник поліції уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд адміністративній комісії"
   },
   {
      "name": "У разі виявлення факту вчинення дрібного хуліганства уповноважені поліцейські зобов'язані:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "У разі виявлення факту куріння тютюнових виробів у місцях, заборонених вчиненірішенням відповідної сільської, селищної, міської ради, поліцейський уповноважений:",
      "value": "винести постанову про накладення штрафу"
   },
   {
      "name": "У разі виявлення факту порушення встановленого законом порядку перебування дітей у закладах, у яких провадиться діяльність у сфері розваг, або закладах громадського харчування, уповноважений поліцейський має право:",
      "value": "скласти протокол, винести постанову"
   },
   {
      "name": "У разі виявлення факту поширення неправдивих чуток уповноважені поліцейські зобов'язані:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "У разі виявлення факту торгівлі з рук у невстановлених місцях, поліцейський уповноважений:",
      "value": "- скласти протокол про адміністративне правопорушення, застосувати адміністративне затримання з оглядом та вилученням предметів торгівлі, надіслати матеріали справи до суду"
   },
   {
      "name": "У разі вчинення злісної непокори законному розпорядженню або вимозі поліцейського, неповнолітній:",
      "value": "скласти протокол на неповнолітнього за статтею 185 КУпАП"
   },
   {
      "name": "У разі заподіяння шкоди здоров'ю людей їх майну внаслідок порушення правил утримання собак і котів, справа про адміністративне правопорушення за статтею 154 КУпАП розглядається:",
      "value": "судом"
   },
   {
      "name": "У разі прояву злісної непокори законному розпорядженню або вимозіполіцейського під час виконання службових обов'язків, поліцейський уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "У разі прояву злісної непокори законному розпорядженню або вимозі поліцейськогонеповнолітньою особою віком 16 років, поліцейський має ораво:",
      "value": "скласти протокол на неповнолітнього за статтею 185 КУпАП"
   },
   {
      "name": "У разі прояву злісної непокори законному розпорядженню або вимозі поліцейського неповнолітньою особою віком до 16 років, поліцейські уповноважені:",
      "value": "скласти протокол на одного з батьків за ч. З стаз іі 184 КУпАП"
   },
   {
      "name": "У разі прояву злісної непокори законному розпорядженню або вимозіоліцейського неповнолітньою особою віком до 16 років, уповноважений поліцейський маєправо:",
      "value": "скласти протокол на одного з батьків за статтею 185 КУпАП"
   },
   {
      "name": "У разі публічних закликів до невиконання розпоряджень або вимог поліцейського у зв'язкуз виконанням ним обов'язків по охороні громадського порядку, gоліцейський уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "У разі публічних закликів до невиконання розпоряджень або вимог поліцейського у зв'язку з виконанням ним обов'язків но охороні громадського порядку, поліцейський уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "Хто мас право складати протоколи та виносити постанови за куріння у заборонених місцях:",
      "value": "співробітники Національної поліції"
   },
   {
      "name": "Хто розглядає адміністративну справу про поширення неправдивих чуток:",
      "value": "суд"
   },
   {
      "name": "Хто розглядає справу про адміністративне правопорушення передбачене ст.44 КУпАП:",
      "value": "суд, орган Національної поліції"
   },
   {
      "name": "Чи звільняється особа, що добровільно здала наркотичні засоби або психотропні речовини, які були у неї в невеликих розмірах від адміністративної відповідальності:",
      "value": "так"
   },
   {
      "name": "Чи має право керівник територіального органу Національної поліції дати дозвіл на продовження строків адміністративного затримання особи додатково на 3 години?",
      "value": "таких повноважень не має"
   },
   {
      "name": "Як має діяти поліцейський в разі виявлення адміністративного правопорушення в сфері забезпечення безпеки дорожнього руху, розгляд якого віднесено до компетенції Національної поліції, якщо правопорушник є неповнолітньою особою (17 рокі?",
      "value": "Скласти протокол про адміністративне правопорушення."
   },
   {
      "name": "Які ігри відносяться відповідно до закону до азартних:",
      "value": "гра в рулетку, більярд на гроші, речі та інші цінності"
   },
   {
      "name": "Які ігри відносяться відповідно до закону до азартних:",
      "value": "гра в карти на гроші, речі та інші цінності"
   },
   {
      "name": "Які дії вважаються виконанням поліцейським службових обов'язків з охорони громадського порядку:",
      "value": "несення постової чи патрульної служби з охорони громадського порядку"
   },
   {
      "name": "Які обставини обтяжують відповідальність за самоправне зайняття житлового приміщення:",
      "value": "усі відповіді вірні"
   },
   {
      "name": "Які правопорушення, не належать до тих, що посягають на громадський порядокі громадську безпеку:",
      "value": "незаконний посів або незаконне вирощування снотворного маку чи конопель"
   },
   {
      "name": "Які протиправні діяння кваліфікуються як дрібне хуліганство за статтею 173 КУпАП:",
      "value": "докучлива, груба, розв'язна поведінка в громадському місці з мстою прояву звеваги до суспільства, честі та гідності людини, що може супроводжуватись нецензурною лайкою"
   },
   {
      "name": "Які протиправні діяння кваліфікуються як злісна непокора законному розпорядженню або вимозі поліцейського за статтею 185 КУпАП:",
      "value": "особа вперто не бажає виконувати розпорядження або дотримуватись вимоги поліцейського припинити правопорушення"
   },
   {
      "name": "Які протиправні діяння кваліфікуються як злісна непокора законному розпорядженню або вимозі поліцейського за статтею 185 КУпАП :",
      "value": "особа вперто не бажає виконувати розпорядження або дотримуватись вимоги поліцейського припинити правопорушенні"
   },
   {
      "name": "Які процесуальні документи за змістом і функціями НЕ належать до документів, що фіксують фактичні обставини у справах про адміністративні правопорушення?",
      "value": "висновок експерта"
   },
   {
      "name": "Які процесуальні документи за змістом і функціями НЕ належать до документів, що забезпечують провадження у справах про адміністративні правопорушення?",
      "value": "протокол про адміністративне правопорушення"
   },
   {
      "name": "Які процесуальні документи за змістом не належать до документів, які є формою рішення суб'єктів адміністративно-процесуальної діяльності у справах про адміністративні правопорушення?",
      "value": "протокол про адміністративне затримання"
   },
   {
      "name": "Які суб'єкти не забовязані підписати протокол про адміністративне правопорушення, але мають право на це?",
      "value": "правопорушник"
   },
   {
      "name": "Яка кількість виправлень у протоколі про адміністративне правопорушення є допустимою?",
      "value": "такі виправлення не допускаються"
   },
   {
      "name": "Яка ознака хуліганських дій. що вчиняються в громадських місцях, дозволяє кваліфікувати їх як кримінальне правопорушення за ч. 1 ст. 296 КК України:",
      "value": "особлива зухвалість чи винятковій цінізм правопорушника"
   },
   {
      "name": "Яка стаття КУпАП передбачає відповідальність за вчинення насильства в сім'ї?",
      "value": "ст. 173-2"
   },
   {
      "name": "Яка стаття КУпАП передбачає відповідальність за невжиття заходів шодо забезпечення охорони посівів снотворного маку чи конопель, місць їх зберігання та переробки:",
      "value": "ст. 106-1"
   },
   {
      "name": "Яка стаття КУпАП передбачає відповідальність за стрільбу з вогнепальної, холодної метальної, пневматичної зброї у населених пунктах:",
      "value": "ст. 174"
   },
   {
      "name": "Яка стаття КУпАП передбачає відповідальність за ухилення від медичного огляду чи медичного обстеження:",
      "value": "ст. 44-1"
   },
   {
      "name": "Який документ засвідчує реєстрацію домашньої тварини:",
      "value": "реєстраційне посвідчення та номерній індивідуальний знак (жетон)"
   },
   {
      "name": "Який документ не належить до джерел доказів у справах про адміністративні правопорушення:",
      "value": "рапорт про адміністративне затримання"
   },
   {
      "name": "Який захід забезпечення провадження застосовуються як КРАЙНІЙ для припинення правопорушень за статтями 185,185-7 КУпАП:",
      "value": "адміністративне затримання"
   },
   {
      "name": "Який орган уповноважений розглядати справу про адміністративне правопорушення, передбачене ст. 51 КУпАП?",
      "value": "суд"
   },
   {
      "name": "Який процесуальний документ є доказом у справі про адміністративне правопорушення:",
      "value": "пояснення особи"
   },
   {
      "name": "Який процесуальний документ є формою рішення у справі про адміністративні правопорушення:",
      "value": "постанова"
   },
   {
      "name": "Який строк розгляду справи про адміністративне правопорушення за статтею 154 КУпАП:",
      "value": "у п'ятнадцятиденний строк"
   },
   {
      "name": "Який строк розгляду справи про адміністративне правопорушення за статтею 155 КУпАП:",
      "value": "у п'ятнадцятиденний строк"
   },
   {
      "name": "Який термін розгляду спряв про адміністративні правопорушення,передбачені частиною першою статті 44, статтями 44-1,106-1,106-2 КУпАП:",
      "value": "протягом доби"
   },
   {
      "name": "Який час необхідно вказувати в протоколі про адміністративне затримання особи в різі доставлення правопорушника до органу Національної поліції?",
      "value": "час фактичного затримання особи"
   },
   {
      "name": "Яких захід забезпечення провадження застосовується як крайній для припинення правопорушеньза статтями 185,185-7 КУпАП:",
      "value": "адміністративне затримання"
   },
   {
      "name": "Яку інформацію необхідно зазначити в протоколі про адміністративне правопорушення в графі \"місце його складання\"?",
      "value": "назва населеного пункту"
   },
   {
      "name": "Якщо в тексті протоколу зроблено виправлення, поліцейський:",
      "value": "заповнює новий бланк протоколу та доповідає рапортом керівнику підрозділу про підстави виправлення"
   },
   {
      "name": "Якщо неповнолітній віком до 16 років продає пачки сигарет на вулиці, дільничний офіцер поліції уповноважений:",
      "value": "- скласти протокол на батьків за ч.З ст.  184 КУпАП"
   },
   {
      "name": "Якщо неповнолітня особа курить тютюнові вироби у заборонених законом місцях,справа про адміністративне правопорушення розглядається:",
      "value": "судом"
   },
   {
      "name": "Якщо особа є суб'єктом права на безоплатну вторинну правову допомогу, у розгляді справи про адміністративне правопорушення може брати участь адвокат:",
      "value": "який призначений Центром з надання безоплатної вторинної правової допомоги"
   },
   {
      "name": "Якщо особа двічі протягом року піддавалась адміністративному стягненню за розпивання спиртних напоїв або появу в п'яному вигляді, поліцейський:",
      "value": "складає протокол про адміністративне правопорушення та передає на розгляд суду"
   },
   {
      "name": "Якщо особа, стосовно якої складається протокол, не володіє ; українською мовою, то:",
      "value": "протокол складається українською мовою за участю перекладача"
   },
   {
      "name": "Якщо особа, яка притягується до відповідальності, відмовляється підписувати протокол, але згодна дати пояснення на окремому аркуші з причин такої відмови, то поліцейським:",
      "value": "пояснення складається, додається до протоколу"
   },
    {
      "name": "Адміністративна юрисдикція поділяється на такі види:",
      "value": "адміністративно-регулятивну, адміністративно деліктну та адміністративно-судочинну;"
   },
   {
      "name": "В якій статті глави 17 КУпАП зазначається підвідомчість справ про адміністративні правопорушення до органів Національної поліції:",
      "value": "Статті 222КУпАП;"
   },
   {
      "name": "В який термін може бути подано скаргу на постанову стосовно справи:",
      "value": "10 днів;"
   },
   {
      "name": "Вкажіть з чого розпочинається правильний порядок розгляду справи про адміністративне правопорушення передбачений статтею 279 КУпАП:",
      "value": "З оголошення складу колегіального органу або представлення посадової особи, яка розглядає дану справу;"
   },
   {
      "name": "Вкажіть зайвий нормативний документ який не відноситься до діяльності засобів масової інформації в частині контролю за НПУ:",
      "value": "Закон України Про корупцію;"
   },
   {
      "name": "Вкажіть зайвий принцип в діяльності поліції:",
      "value": "демократизму."
   },
   {
      "name": "Вкажіть методи АЮДНПУ:",
      "value": "метод переконання та примусу;"
   },
   {
      "name": "Вкажіть послідовність дій передбачених статтею 18 Закону України Про Національну поліцію - коли звертаючись до особи, або у разі звернення особи до поліцейського, поліцейський зобов'язаний:",
      "value": "Назвати своє прізвище, посаду, спеціальне звання та пред'явити на її вимогу службове посвідчення;"
   },
   {
      "name": "Вкажіть правильне визначення, що таке юрисдикція:",
      "value": "визначається як сукупність повноважень відповідних державних органів, вирішувати правові спори і справи про правопорушення;"
   },
   {
      "name": "Громадянин, який звернувся із заявою чи скаргою до підрозділу поліції превентивної діяльності, має права, визначені ст. 18 Закону України \"Про звернення громадян\":",
      "value": "всі відповіді вірно."
   },
   {
      "name": "Громадянину за наслідками розгляду його скарги надається:",
      "value": "письмова або усна відповідь;"
   },
   {
      "name": "Дисциплінарне стягнення  не може бути накладено,  якщо з дня вчинення  проступку  минуло:",
      "value": "більше півроку;"
   },
   {
      "name": "Дисциплінарне стягнення може бути оскаржене:",
      "value": "протягом трьох місяців з дня ознайомлення з наказом;"
   },
   {
      "name": "До основних принципів дисциплінарного провадження відносять:",
      "value": "законність, презумпцію невинуватості, рівність усіх перед законом, гласність та економічність;"
   },
   {
      "name": "До перевірки звернень громадян можуть залучатися за згодою:",
      "value": "представники громадськості."
   },
   {
      "name": "До перевірки звернень громадян можуть залучатися за згодою:",
      "value": "представники громадськості."
   },
   {
      "name": "За своїм внутрішнім переконанням, що ґрунтується на всебічному, повному і об'єктивному дослідженні всіх обставин справи  в  їх  сукупності,  керуючись законом і правосвідомістю орган чи посадова особа робить:",
      "value": "Оцінку доказі"
   },
   {
      "name": "Загальну систему поліції складають:",
      "value": "центральний орган управління поліцією та територіальні органи поліції."
   },
   {
      "name": "Закон України Про заходи щодо попередження та зменшення вживання тютюнових виробів і їх шкідливого впливу на здоров'я населення зазначає, що частина  (частини)  будь-якої  будівлі, споруди,  яка доступна або відкрита для населення  вільно, чи за запрошенням,  або за плату, постійно, періодично або час від часу, в тому числі під'їзди, а також підземні переходи, стадіони це є:",
      "value": "Громадське місце."
   },
   {
      "name": "Залежно від кількісного складу суб'єктів подання скарги поділяються на:",
      "value": "колективні та індивідуальні."
   },
   {
      "name": "Засоби адміністративного запобігання це:",
      "value": "усі відповіді вірні."
   },
   {
      "name": "Заходи припинення можна поділити на:",
      "value": "загальні та спеціальні."
   },
   {
      "name": "Звернення військовослужбовців, а також членів їх сімей вирішуються в термін:",
      "value": "до 15 днів з моменту подання заяви;"
   },
   {
      "name": "Звернення розглядаються і вирішуються в термін:",
      "value": "не більше одного місяця від дня їх отримання."
   },
   {
      "name": "Звернення які не потребують додаткового вивчення та проведення перевірки за ними, розглядаються у такий термін:",
      "value": "невідкладно, але не пізніше 15 днів від дня їх отримання."
   },
   {
      "name": "Згідно з чинним законодавством дисциплінарна відповідальність державних службовців, до яких належать і працівники Національної поліції України, настає за:",
      "value": "усі відповіді вірні."
   },
   {
      "name": "ЗУ \"Про Національну поліцію\" був прийнятий:",
      "value": "02 липня 2015 року;"
   },
   {
      "name": "Керівником та заступниками керівника поліції може бути призначена особа, яка:",
      "value": "всі відповіді вірні."
   },
   {
      "name": "Ким спрямовується та координується діяльність Національної поліції України:",
      "value": "Кабінетом Міністрів України та Міністра внутрішніх справ України;"
   },
   {
      "name": "Конституція України ст. 63 визначає \"близьких родичів\" до них відносимо:",
      "value": "подружжя, батьки (мати, батько) й дитина (діти), рідні брати і сестри, дід (бабуся) і онук (онука)."
   },
   {
      "name": "Не підлягають розгляду такі заяви:",
      "value": "особа яка визнана судом недієздатною;"
   },
   {
      "name": "Обраний поліцейський захід має бути:",
      "value": "законним, необхідним, пропорційним та ефективним;"
   },
   {
      "name": "Основними принципами провадження у справах про адміністративні правопорушення є:",
      "value": "усі відповіді вірні."
   },
   {
      "name": "Під час проведення превентивних поліцейських заходів поліція зобов'язана повідомити особі про причини застосування до неї превентивних заходів, а також довести до її відома нормативно-правові акти, на підставі яких застосовуються такі заходи:",
      "value": "Так зобов'язана;"
   },
   {
      "name": "Поліцейський захід-це:",
      "value": "це дія або комплекс дій превентивного або примусового характеру, що обмежує певні права і свободи людини та застосовується поліцейськими відповідно до закону для забезпечення виконання покладених на поліцію повноважень;"
   },
   {
      "name": "Поліцейський може застосовувати фізичну силу, у тому числі спеціальні прийоми боротьби (рукопашного бою), для:",
      "value": "всі відповіді вірні."
   },
   {
      "name": "Поліцейський при спілкуванні з громадянином повинен розмовляти з правопорушником:",
      "value": "Українською мовою;"
   },
   {
      "name": "Попередження як захід адміністративного стягнення може виноситься в усній формі:",
      "value": "Ні;"
   },
   {
      "name": "Посадові особи Національної поліції України, які компетентні приймати і розглядати скарги, в межах своїх повноважень зобов'язані:",
      "value": "забезпечувати поновлення порушених прав;"
   }
]
