[
    {
        "libName": "Криміналістичні_методи_розслідування_кіберзлочинів",
        "answers": [
    {
        "name": "Галузь специфічних наукових знань про злочинну діяльність та її антипод – діяльність щодо виявлення, розкриття і розслідування злочинів та встановлення істини у процесі судочинства − це?",
        "value": "криміналістика;"
    },
    {
        "name": "Хто вперше використав термін «криміналістика»?",
        "value": "Н.Бокаріус;"
    },
    {
        "name": "У якій із відповідей вірно розкрито предмет криміналістики?",
        "value": "закономірності механізму вчинення кримінальних правопорушень;"
    },
    {
        "name": "Систему криміналістики становлять такі її складові частини:",
        "value": "загальна теорія криміналістики (методологічні основи криміналістики); трасологія, криміналістична тактика; криміналістична експертологія;"
    },
    {
        "name": "Розділ криміналістики, який становить собою систему наукових положень і розроблюваних на їх основі рекомендацій щодо організації і здійснення досудового розслідування, запобігання окремих видів кримінальних правопорушень, а також судового розгляду матеріалів провадження щодо них називається:",
        "value": "криміналістичною тактикою;"
    },
    {
        "name": "У яких відповідях правильно названі об’єкти криміналістики?",
        "value": "злочинна діяльність;"
    },
    {
        "name": "Криміналістика не пов’язана з науками:",
        "value": "біологією;"
    },
    {
        "name": "У яких відповідях правильно наведені складові елементи (розділи) науки криміналістики, що у відповідності з сучасними уявленнями більшості вітчизняних науковців-криміналістів утворюють її систему ?",
        "value": "методологія (теоретичні основи) криміналістики;"
    },
    {
        "name": "У яких відповідях правильно наведені види, так званих, загальнонаукових (загальних) методів криміналістики?",
        "value": "техніко-криміналістичні методи;"
    },
    {
        "name": "Яке з понять криміналістичної науки визначається так : \"  - це система правил і понять, необхідних для проведення дослідження щодо встановлення у судочинних цілях наявності чи  відсутності тотожності порівнюваних об’єктів\"?",
        "value": "1) криміналістична теорія ідентифікації;"
    },
    {
        "name": "Вкажіть критерій дотримання законності криміналістичної ідентифікації?",
        "value": "1) виконання вимог процесуальних норм;"
    },
    {
        "name": "У якій відповіді неправильно названо вимогу, якій повинні відповідати зразки для ідентифікаційного порівняльного дослідження?",
        "value": "1) достовірність (тобто не повинно бути жодних сумнівів щодо походження зразків);"
    },
    {
        "name": "У якій відповіді неправильно названо стадію ідентифікаційного дослідження?",
        "value": "1) стадія попереднього дослідження;"
    },
    {
        "name": "У яких відповідях правильно наведені положення, що розкривають сутність криміналістичної ідентифікації?",
        "value": "1) у процесі криміналістичної ідентифікації беруть участь дві групи об’єктів: ті, що підлягають ідентифікації і ті, з допомогою яких проводиться ідентифікація;"
    },
    {
        "name": "Які положення розкривають сутність криміналістичної діагностики?",
        "value": "1) у криміналістичних дослідженнях ідентифікація завжди передує діагностиці;"
    },
    {
        "name": "Криміналістична техніка – це:",
        "value": "розділ криміналістики про систему наукових положень та рекомендацій щодо застосування тактичних прийомів, комбінацій та операцій, призначенням яких є збір, фіксація та дослідження доказової інформації для виявлення, розслідування, судового розгляду та попередження кримінальних правопорушень;"
    },
    {
        "name": "Науковою основою становлення, формування і удосконалення Криміналістичної техніки як розділу криміналістики є:",
        "value": "1) гуманітарні науки;"
    },
    {
        "name": "Не є галуззю Криміналістичної техніки як розділу криміналістики?",
        "value": "криміналістична фотографія;"
    },
    {
        "name": "До системи Криміналістичної техніки не входять:",
        "value": "судова балістика;"
    },
    {
        "name": "Назвіть критерій допустимості засобів Криміналістичної техніки, який зазначено неправильно?",
        "value": "1) законність;"
    },
    {
        "name": "В яких із наведених варіантів правильно названо найбільш поширені методи польової криміналістики?",
        "value": "поляризаційні методи;"
    },
    {
        "name": "До системи Криміналістичної техніки як розділу криміналістики входять такі складові:",
        "value": "підрозділи Криміналістичної техніки;"
    },
    {
        "name": "Завданнями Криміналістичної техніки є:",
        "value": "встановлення властивостей і станів, групової належності й тотожності об’єктів-джерел інформації;"
    },
    {
        "name": "У якій послідовності необхідно розташувати етапи роботи зі слідами: 1-виявлення; 2-фіксація; 3-огляд; 4-вилучення?",
        "value": "1) 1,2,3,4;"
    },
    {
        "name": "Криміналістична реєстрація – це:",
        "value": "наукова система реєстрації певних об’єктів та їх ідентифікаційних ознак для запобігання кримінальним правопорушенням, їх розкриття, розшуку та впізнання об'єктів, узятих на облік;"
    },
    {
        "name": "У якому з наведених варіантів правильно вказано основне завдання криміналістичної реєстрації?",
        "value": "забезпечити доступність інформації, що міститься у відповідних криміналістичних обліках всім громадянам;"
    },
    {
        "name": "У яких відповідях правильно вказано, які види обліків функціонують в Україні?",
        "value": "облік записів голосів та мовлення осіб;"
    },
    {
        "name": "Яким чином можна використовувати метод аналізу мережевого трафіку у розслідуванні кіберзлочинів?",
        "value": "A) Для визначення IP-адреси потенційного злочинця."
    },
    {
        "name": "Що означає термін «кіберзлочин»?",
        "value": "a) Злочин, який відбувається в кіберпросторі."
    },
    {
        "name": "Яка з наведених нижче методик є складовою криміналістичного аналізу в кіберзлочинах?",
        "value": "a) Аналіз системи безпеки."
    },
    {
        "name": "Який інструмент часто використовується для збору електронних доказів у кіберзлочинах?",
        "value": "a) Металодетектор."
    },
    {
        "name": "Яка з наступних технік є важливою для розкриття кіберзлочинів, пов'язаних зі зламом безпеки мережі?",
        "value": "a) Соціологічне опитування."
    },
    {
        "name": "Яким чином криміналісти використовують метод стеганографії під час розслідування кіберзлочинів?",
        "value": "a) Для визначення місцезнаходження злочинців."
    },
    {
        "name": "Які з наведених методів є криміналістичними при розслідуванні кіберзлочинів?",
        "value": "a) Віруси"
    },
    {
        "name": "Який метод криміналістичного розслідування кіберзлочинів використовується для аналізу жорсткого диска комп'ютера з метою відновлення втрачених або видалених даних?",
        "value": "a) Експертиза інтернет-трафіку"
    },
    {
        "name": "Які методи можуть бути використані для розслідування кіберзлочинів?",
        "value": "a) Кримінально-технічний аналіз"
    },
    {
        "name": "Яким методом криміналістики можна виявити електронні сліди, залишені на комп'ютері під час вчинення кіберзлочину?",
        "value": "a) Метод аналізу фінансових документів."
    },
    {
        "name": "Яким методом можна встановити джерело електронного листа, що містить загрози?",
        "value": "a) Методом аналізу вмісту листа"
    },
    {
        "name": "Який із наступних методів використовується для аналізу цифрових слідів у кіберзлочинності?",
        "value": "a) Відбитки пальців"
    },
    {
        "name": "Яким методом криміналістики найефективніше можна виявити цифрові сліди в кіберзлочинах?",
        "value": "a) Метод огляду місця події"
    },
    {
        "name": "Які з наступних методів використовуються в криміналістиці для розслідування кіберзлочинів?",
        "value": "a) Агресивне переконання підозрюваного"
    },
    {
        "name": "Яка з наступних технік використовується для виявлення та аналізу електронних доказів?",
        "value": "a) Кіберспостереження"
    },
    {
        "name": "Яка методика використовується для визначення місця розташування злочинця в кіберпросторі?",
        "value": "a) IP-трекінг"
    },
    {
        "name": "Яка з методів допомагає у виявленні цифрових слідів, залишених на зламаному комп'ютері?",
        "value": "a) Кіберспостереження"
    },
    {
        "name": "Якість електронних доказів може бути піддана сумніву через:",
        "value": "a) Психологічні фактори"
    },
    {
        "name": "Який з наступних методів криміналістики застосовується для аналізу жорстких дисків та виявлення слідів кіберзлочинів?",
        "value": "a) Метод криптоаналізу"
    },
    {
        "name": "Яка криміналістична методика використовується для аналізу цифрових слідів на зараженому комп'ютері?",
        "value": "a) Біологічний аналіз"
    },
    {
        "name": "Які з наступних методів використовуються в криміналістиці для розслідування кіберзлочинів?",
        "value": "a) Молекулярно-біологічні методи"
    },
    {
        "name": "Який з методів криміналістичного розслідування кіберзлочинів полягає в аналізі даних, вилучених з електронних пристроїв та мережі Інтернет?",
        "value": "a) Кримінально-технічна експертиза"
    },
    {
        "name": "Яким чином можна виявити прихований код у веб-сторінці, що використовується для здійснення кіберзлочинів?",
        "value": "a) Використовуючи звичайні методи відлагодження браузера."
    },
    {
        "name": "Який з наступних методів криміналістики використовується для розслідування кіберзлочинів?",
        "value": "a) Автопсія"
    },
    {
        "name": "Які з наступних методів найчастіше використовуються при розслідуванні кіберзлочинів?",
        "value": "a) Мікроскопія"
    },
    {
        "name": "Яка з наведених технік часто використовується в розслідуванні кіберзлочинів для збору електронних доказів?",
        "value": "А) Експертиза відбитків пальців."
    },
    {
        "name": "До техніко-криміналістичних засобів виявлення слідів можна віднести:",
        "value": "А) різноманітні прилади, що застосовуються для освітлення приміщень, ділянок місцевості, предметів і людей, які надають змогу створювати розсіяне, спрямоване освітлення;"
    },
    {
        "name": "Яка інформація може бути отримана шляхом аналізу файлових метаданих?",
        "value": "a) Ім'я власника комп'ютера"
    },
    {
        "name": "Яка техніка аналізу використовується для виявлення хибних чи прихованих даних на носіях інформації?",
        "value": "a) Криптографічний аналіз"
    },
    {
        "name": "Що включає собою процес аналізу цифрових слідів у розслідуванні кіберзлочинів?",
        "value": "a) Виявлення й аналіз вірусів"
    },
    {
        "name": "Який інструмент використовується для аналізу трафіку на мережі з метою виявлення аномальної активності?",
        "value": "a) Wireshark"
    },
    {
        "name": "Яка техніка використовується для виявлення та вивчення вразливостей програмного забезпечення?",
        "value": "a) Penetration testing"
    },
    {
        "name": "Що включає собою аналіз слідів від кіберзлочинів?",
        "value": "a) Виявлення й аналіз фізичних слідів"
    },
    {
        "name": "Що робить інструмент EnCase Forensic у сфері криміналістики комп'ютерних технологій?",
        "value": "a) Виявляє вразливості в програмному забезпеченні"
    },
    {
        "name": "Який метод застосовується для виявлення й аналізу шкідливих програм на комп'ютері?",
        "value": "a) Аналіз вмісту соціальних мереж"
    },
    {
        "name": "Яким чином криміналісти вивчають інформаційний обмін між кіберзлочинцями?",
        "value": "a) Аналізують IP-адреси"
    },
    {
        "name": "Яка техніка використовується для аналізу зміни в системі після можливої атаки?",
        "value": "a) Відновлення з резервних копій"
    },
    {
        "name": "Що таке дігітальний форензик?",
        "value": "a) Спеціалізована галузь кіберзлочинів, яка вивчає засоби безпеки інформації."
    },
    {
        "name": "Який метод може використовуватися для виявлення хакерських атак на комп'ютерні системи?",
        "value": "a) Аналіз слідів на місці події."
    },
    {
        "name": "Які інструменти використовуються для аналізу цифрових слідів у справах про кіберзлочини?",
        "value": "a) Wireshark, Metasploit, Nessus."
    },
    {
        "name": "Що таке phishing (виманювання паролів)?",
        "value": "a) Виявлення вразливостей програмного забезпечення."
    },
    {
        "name": "Що означає термін \"відбиток пальців\" в контексті кіберзлочинів?",
        "value": "a) Цифровий слід, який може бути використаний для ідентифікації злочинця."
    },
    {
        "name": "Що таке DDOS-атака?",
        "value": "a) Видалення даних з комп'ютера жертви."
    },
    {
        "name": "Що таке ransomware (викрадення даних)?",
        "value": "a) Використання спеціальних програм для отримання несанкціонованого доступу до даних."
    },
    {
        "name": "Який метод може бути використаний для виявлення криптовалютних транзакцій, пов'язаних з кіберзлочинами?",
        "value": "a) Аналіз даних телефонних дзвінків."
    },
    {
        "name": "Яка роль соціальної інженерії в кіберзлочинах?",
        "value": "a) Використання соціальних мереж для поширення вірусів."
    },
    {
        "name": "Які методи можуть бути використані для аналізу електронної пошти у розслідуванні кіберзлочинів?",
        "value": "a) Перехоплення трафіку на роутері."
    },
    {
        "name": "Що таке кіберзлочини?",
        "value": "a) Злочини, вчинені за допомогою кібернетичних знарядь"
    },
    {
        "name": "Який інструмент використовується для аналізу цифрових слідів на місці кіберзлочину?",
        "value": "a) Фотокамера"
    },
    {
        "name": "Що таке фішинг?",
        "value": "a) Атака, яка полягає в імітації легітимної компанії або організації з метою вибору конфіденційних даних"
    },
    {
        "name": "Що таке мальвара (malware)?",
        "value": "a) Програмне забезпечення, що містить шкідливий код, який може завдати шкоди комп'ютеру або мережі"
    },
    {
        "name": "Які з наступних кроків можуть виконуватися під час криміналістичного аналізу цифрових доказів?",
        "value": "a) Виявлення, збір та дослідження цифрових слідів"
    },
    {
        "name": "Що означає термін \"DDoS”?",
        "value": "a) Децентралізована дистрибуція системи організації"
    },
    {
        "name": "Які методи можуть використовуватися для аналізу мережевих протоколів під час розслідування кіберзлочинів?",
        "value": "a) Дослідницький аналіз"
    },
    {
        "name": "Яка із наведених технік використовується для аналізу цифрових слідів у кіберзлочинах?",
        "value": "a) Експертиза наркотиків"
    },
    {
        "name": "Що означає термін \"IP-адреса\" у контексті кіберзлочинів?",
        "value": "a) Інтернет-протокольна адреса, яка ідентифікує пристрій у мережі"
    },
    {
        "name": "Яка з інструментальних систем використовується для аналізу дискового простору під час розслідування кіберзлочинів?",
        "value": "a) Wireshark"
    },
    {
        "name": "Яким чином можна виявити вірусні програми на комп'ютері під час розслідування кіберзлочинів?",
        "value": "a) Аналізуючи веб-історію"
    },
    {
        "name": "Які інструменти можуть бути використані для аналізу мережевого трафіку під час розслідування кіберзлочинів?",
        "value": "a) Nmap"
    },
    {
        "name": "Яка з інструментальних систем використовується для аналізу пам'яті комп'ютера під час розслідування кіберзлочинів?",
        "value": "a) FTK Imager"
    },
    {
        "name": "Яким чином можна провести аналіз логів серверів у розслідуванні кіберзлочинів?",
        "value": "a) Використовуючи аналітичний софт"
    },
    {
        "name": "Що включає в себе цифровий облік кіберзлочину?",
        "value": "a) Збір електронних доказів"
    },
    {
        "name": "Які методи можна використовувати для ідентифікації злочинців у кіберпросторі?",
        "value": "a) Аналіз IP-адрес"
    },
    {
        "name": "Які методи аутентифікації можна використовувати для збору електронних доказів у кіберзлочинах?",
        "value": "a) Біометричні дані"
    },
    {
        "name": "Які техніки можуть бути використані для аналізу шифрування в кіберзлочинах?",
        "value": "a) Криптоаналіз"
    },
    {
        "name": "Яка роль мережевих журналів у розслідуванні кіберзлочинів?",
        "value": "a) Виявлення порушень безпеки"
    },
    {
        "name": "Які методи можна використовувати для аналізу мобільних пристроїв у кіберзлочинах?",
        "value": "a) Візуальний огляд"
    },
    {
        "name": "Які техніки можна використовувати для аналізу вірусних програм у кіберзлочинах?",
        "value": "a) Відлагодження вірусних програм"
    },
    {
        "name": "Яким чином можна виявити цифрові сліди у кіберзлочинах?",
        "value": "a) Аналіз файлової системи"
    },
    {
        "name": "Які методи можуть бути використані для аналізу соціальних мереж у кіберзлочинах?",
        "value": "a) Моніторинг активності користувачів"
    },
    {
        "name": "Що таке форензичний аналіз даних?",
        "value": "a) Шифрування конфіденційної інформації"
    },
    {
        "name": "Яка методика часто використовується для аналізу відповідей на атаки на інформаційні системи?",
        "value": "a) SWOT-аналіз"
    },
    {
        "name": "Що таке методика \"перевертання\" (reverse engineering) в кібербезпеці?",
        "value": "a) Створення засобів анонімізації даних"
    },
    {
        "name": "Яка з наступних технік використовується для визначення авторства в кіберзлочинах?",
        "value": "a) Графологічний аналіз"
    },
    {
        "name": "Що таке цифровий підпис?",
        "value": "a) Цифровий код, що ідентифікує користувача в мережі"
    },
    {
        "name": "Що таке кіберслідчість?",
        "value": "a) Визначення шляхів уникнення кібератак"
    },
    {
        "name": "Які методи аналізу застосовуються для виявлення та вирішення кіберзлочинів?",
        "value": "a) Часовий аналіз, аналіз структури даних, аналіз відповідей"
    },
    {
        "name": "Яка з наступних технік використовується для реконструкції подій в кіберзлочинах?",
        "value": "a) Логічний аналіз"
    },
    {
        "name": "Яким чином можна ідентифікувати виконавця кіберзлочину через його IP-адресу?",
        "value": "a) Пошук за відбитком пальців у мережі"
    },
    {
        "name": "Що таке \"загальний ключ\" (public key) в криптографії?",
        "value": "a) Ключ, який відкриває доступ до всіх захищених ресурсів"
    }
]
    },
    {
        "libName": "Земельне та аграрне право, студенти 5  курс, 2023/2024 н.р.",
        "answers": [
            {
                "name": "Чим регулюються земельні відносини?",
                "value": "Конституцією України, Земельним кодексом України, а також прийнятими відповідно до них нормативно-правовими актами;"
            },
            {
                "name": "Система земельного права містить інститут?",
                "value": "юридичної відповідальності за порушення земельного законодавства;"
            },
            {
                "name": "Система земельного права — це?",
                "value": "сукупність правових інститутів, кожен з яких складається з групи юридичних норм, що регулюють однорідні земельні відносини;"
            },
            {
                "name": "Під принципами земельного права розуміють?",
                "value": "керівні засади у земельному законодавстві, що виражають сутність норм"
            }
        ]
    }
]
