[
    {
        "libName": "Основи адміністративно-юрисдикційної діяльності",
        "answers": [
            {
                "name": "1.       Перебування доставленої особи у штабі громадського формування з охорони громадського порядку чи громадському пункті з охорони громадського порядку ",
                "value": "Відповідь – не може тривати більш як 3 години. "
            },
            {
                "name": "2.       У разі виявленя факту проведення передвиборної агітації в день виборів або референдуму поліцейський уповноважений ",
                "value": "Відповідь – скласти протокол про адмін правопорушення та передати на розгляд суду"
            },
            {
                "name": "3.       Ліцензії на право роздрібної торгівлі алкогольними напоями і тютюновими виробами видаються на ",
                "value": "Відповідь – на один рік "
            },
            {
                "name": "4.       Які протиправні діяння кваліфікуються як злісна непокора законному розпорядженню або вимозі поліцеейського за статтею 185 КУпАП",
                "value": "Відповідь – особа вперто не бажає виконувати розпорядження або дотримуватись вимоги поліцейського припинити правопорушення "
            },
            {
                "name": "5.       Поліцейським за крадіжку з супермаркету вартістю 454 грн. Затримано особу. До якого виду юридичної відповідальності вона може бути притягнута?",
                "value": "Відповідь – кримінальної"
            },
            {
                "name": "6.       Адміністративна відповідальність настає за наявністю таких підстав ",
                "value": "Відповідь – нормативних, фактичних, документальних"
            },
            {
                "name": "7.       Перелік місць, в яких заборонено споживання пива, алкогольних та слабоалкогольних напоїв, вин столових визначається ",
                "value": "Відповідь – законодавчим актом, та органів місцевого самоврядування"
            },
            {
                "name": "8.        Хто розглядає справу про адміністративне правопорушення передбачене ст. 44 КУпАП ",
                "value": "Відповідь – суд, орган Нац поліція "
            },
            {
                "name": "9.       Адміністративне стягнення за зайняття проституцією складається ",
                "value": "Відповідь – уповноваженими поліцейськими та адміністративною комісією."
            },
            {
                "name": "10.   При вилученні предметів торгівлі у невстановлених місцях складається ",
                "value": "Відповідь – відмітки про вилучення вносяться до протоколу про адміністративне правопорушення."
            },
            {
                "name": "11.   Органи місцевого самоврядування в межах відповідної адміністративної території на підставі закону ",
                "value": "Відповідь – мають право заборонити або обмежити споживання пива (крім пива у пластиковій тарі ), алкогольних, слабоалкогольних напоїв, вин столових та куріння тютюнових виробів."
            },
            {
                "name": "12.   Адміністративну відповідальність за правопорушення у сфері забезпечення безпеки дорожнього руху зафіксовані в автоматичному режимі",
                "value": "Відповідь – несуть юридичні та фізичні особи за якими зареєстровано транспортний засіб."
            },
            {
                "name": "13.   У разі виявлення порушення правил вигулу домашніх тварин поліцейський уповноважений",
                "value": "Відповідь – скласти протокол про адміністративне правопорушення та передати на розгляд адмістративної комісії "
            },
            {
                "name": "14.   Справа про торгівлю з рук у невтановлених місцях розглядаються ",
                "value": "Відповідь – судом в 3 денний строк "
            },
            {
                "name": "15.   Чи звільняється особа що добровільно здала наркотичні засоби або психотропні речовини які були у неї в невеликих розмірах від адмін відповідальності ",
                "value": "Відповідь – так "
            },
            {
                "name": "16.   Чи має право керівник територіального органу Нац поліції дати дозвіл на продовження строків адмін затримання особи додатково на 3 години? ",
                "value": "Відповідь – таких повноважень немає"
            },
            {
                "name": "17.   Об’єктивну сторону правопорушення передбаченого статтею 181 КУпАП становлять",
                "value": "Відповідь – ворожіння на будь-чому у громадських місцях за винагороду"
            },
            {
                "name": "18.   Адміністративне затримання особи яка не виконала законне розпорядження або вимогу поліцейського або вимогу поліцейського може тривати не більш",
                "value": "Відповідь – 3 діб"
            },
            {
                "name": "19.   Який захід забезпечення провадження застосовуються як КРАЙНІЙ для припинення правопорушень за статтями 185,185-7 КупАП ",
                "value": "ВІдповідь – адміністративне затримання"
            },
            {
                "name": "20.   Який документ засвідчує реєстрацію домашньої тварини",
                "value": "Відповідь – реєстраційне посвідчення та номерній індивідуальний знак (жетон)"
            },
            {
                "name": "21.   Справа про адмін правопорушеня пердбачене статтею 173 КУпАП рзглядається ",
                "value": "Відповідь – протягом доби "
            },
            {
                "name": "22.   Перебування доставленої особи у штабі громадського формування з охорони громадського порядку чи громадському пункті з охорони громадського порядку ",
                "value": "Відповідь – не може тривати більш як 3 години"
            },
            {
                "name": "23.   У разі виявлення факту проведення передвиборної агітації в день виборів або референдуму поліцейський уповноважений ",
                "value": "Відповідь – скласти протокол протокол та передати на розгляд до суду. "
            },
            {
                "name": "24.   Ліцензії на право роздрібної торгівлі алкогольними напоями і тютюновими виробами видаються на ",
                "value": "Відповідь – на один рік. "
            },
            {
                "name": "25.   Які протиправні діяння кваліфікуються як злісна непокора законному розпорядженню або вимозі поліцейського за статтею 185 КУпАП ",
                "value": "Відповідь – особа вперто не бажає виконувати розпорядження або дотримуватись вимоги поліцейського припинити правопорушення."
            },
            {
                "name": "26.   Адміністративна відповідальність настає за наявністю таких підстав ",
                "value": "Відповідь – нормативних, фактичних, документальних.4"
            },
            {
                "name": "27.   У разі заподіяння шкоди заподіяння здоров’ю людей їх майну внаслідок порушення правил утримання собак і котів, справа про адмін правопорушення за статтею 154 КУпАП розглядається ",
                "value": "Відповідь – судом "
            },
            {
                "name": "28.   До обов’язкових ознак обєктивної сторони адміністративного правопорушення належить ",
                "value": "Відповідь – протиправне діяння ( дія чи бездіяльність )"
            },
            {
                "name": "29.   Які дії вважаються виконанням поліцейським службових обов’язків з охорони громадського порядку ",
                "value": "Відповідь – несення постової чи патрульної служби з охорони громадського порядку "
            },
            {
                "name": "30.   Який документ не належить до джерел доказів у справах про пдміністративні правопорушення ",
                "value": "Відповідь – заява потерпілого."
            },
            {
                "name": "31.   Суб’єктивна сторона правопорушення передбаченого ст 51 КУпАП характеризується наявність ",
                "value": "Відповідь – вини у формі прямого умислу "
            },
            {
                "name": "32.   Справа про адміністративне правопорушення за статтею 185 КУпАП розглядається ",
                "value": "Відповідь – протягом доби"
            },
            {
                "name": "33.   Під час вигулу супроводжувати собаку може особа, яка досягла ",
                "value": "Відповідь 14-річного віку."
            },
            {
                "name": "34.   Визначте суб’єкта адміністративної відповідальності за статтею 180-1КУпАП ",
                "value": "Відповідь – посадові особи закладу незалежно від форми власності або громадяни – власники закладу чи уповноважені ними особи "
            },
            {
                "name": "35.   Який процесуальний документ є формою рішення у справі про адмін. Правопорушення",
                "value": "Відповідь – постанова "
            },
            {
                "name": "36.   Предмет посягання відповідно до ст.51 КУпАП ",
                "value": "Відповідь – будь-яке майно"
            },
            {
                "name": "37.   У разі прояву злісної непокори законному розпорядженню або вимозі поліцейського під час виконання службових обв’язків , поліцейський уповноважений",
                "value": "Відповідь – скласти протокол та винести постанову "
            },
            {
                "name": "38.   Адміністративну відповідальність за правопорушення у сфері забезпечення безпеки дорожнього руху, зафіксовані в автоматичному режимі",
                "value": "Відповідь – несуть юридичні та фізичні особи, за якими зареєстровано транспортний засіб."
            },
            {
                "name": "39.   В якому процесуальному документі фіксується застосування заходу забезпечення провадження",
                "value": "Відповідь – протокол про адміністративні правопорушення "
            },
            {
                "name": "40.   Який час необхідно вказувати в протоколі про адмін затримання особи в разі доставлення правопорушника до органу Нац поліції.",
                "value": "Відповідь – час фактичного затримання особи "
            },
            {
                "name": "41.   Строками про адмін правопорушення за статтею 173 КУпАП розглядається ",
                "value": "Відповідь – протягом доби "
            },
            {
                "name": "42.   Які суюєкти не забовязані підписати протокол про адміністративне правопорушення але мають право на це",
                "value": "Відповідь – правопорушник"
            },
            {
                "name": "43.   Яка стаття передбачає відповідальність за ухилення від медичного огляду чи медичного обстеження ",
                "value": "Відповідь – 44-1"
            },
            {
                "name": "44.   На який строк може бути затримано особа на скоєння дрібного викрадення чужого майна ",
                "value": "Відповідь – до 3 годин "
            },
            {
                "name": "45.   При виявлені фактів знаходження в розважальних та ресторанних закладах неповнолітньої в нічний час без супроводу батьків або інших законних представників поліцейським складається протокол адмін правопорушеня на ",
                "value": "Відповідь – посадових осіб закладу незалежно від форми власності або громадян – власників закладу чи уповноважених ними осіб."
            },
            {
                "name": "46.   Протокол про адиін. Правопорушення є недійсним без підпису ",
                "value": "Відповідь – поліцейського"
            },
            {
                "name": "47.   Обовязковою ознакою обєктивної сторони правопорушення яке кваліфікується за статтею 181-1 КУпАП ",
                "value": "Відповідь – винагорода за надання сексуальних послуг "
            },
            {
                "name": "48.   Протоколи про правопорушення передбачені статтею 173-2 розлядаються ",
                "value": "Відповідь – районні, районі у місті, міські чи міськрайонні суди"
            },
            {
                "name": "49.   Справа про адмін правопорушення передбачене статтею 185-7 КУпАП розглядається ",
                "value": "Відповідь – протягом доби "
            },
            {
                "name": "50.   За незаконний посів або незаконне вирощування снотворного маку чи конопель настає відповідальність за ",
                "value": "Відповідь – ст 106-2 КУпАП"
            },
            {
                "name": "51.   Який орган уповноважений розглядати справу про адмін правопорушення передбачене ст 51 КУпАП ",
                "value": "Відповідь – суд"
            },
            {
                "name": "52.   Дозвільна система що здійснюється органами внутрішніх справ не поширюється на ",
                "value": "Відповідь – електронну зброю"
            },
            {
                "name": "53.   Справи про адмін правопорушення що посягають на здійснення народного волевиявлення розглядаються ",
                "value": "Відповідь – в 3 денний строк "
            },
            {
                "name": "54.   Які документи за змістом і функціями не неалежать до документів що забезпечують провадження у справах про адмін правопорушення ",
                "value": "Відповідь – протокол про адмін правопорушення "
            },
            {
                "name": "55.   Відповідно до КУпАП крайня необхідність це",
                "value": "Відповідь – обставина, що виключає адмін відповідальність "
            },
            {
                "name": "56.   Визначте невеликий розмір наркотичного засобу канабіс ( цілі або різного супеня подрібнення будь-які частини рослини роду коноплі ібо їх суміш ",
                "value": "Відпоівдь – до 5 гр"
            },
            {
                "name": "57.   Субєктивна сторона адмін правопорушення характеризується ",
                "value": "Відповідь – виною яка проявляється у формі умислу або необережності "
            },
            {
                "name": "58.   У разі заподіяння шкоди здоровю людей їх майну внаслідок порушення утримання собак чи котів справа про адмін правопорушення за статтею 154 КУпАП розглядається ",
                "value": "Відповідь – судом "
            },
            {
                "name": "59.   З якого віку настає відповідальність за куріння у заборонених місцях ",
                "value": "Відповідь – з 16 років"
            },
            {
                "name": "60.   Субєктивна сторона правопорушення передбаченого ст 51 КУпАП характеризується наявність ",
                "value": "Відповідь – вини у формі прямого умислу "
            },
            {
                "name": "61.   Не дозволяється приводити тварин до обєктів господарського харчування у приміщення магазину і кафе крім ",
                "value": "Відповідь – собак поводарів"
            },
            {
                "name": "62.   У разі виявлення порушення правил торгівлі громадянами які займаються підприємницькою діяльністю працівник поліції уповноважений ",
                "value": "Відповідь – скласти протокол про адмін правопорушення та передати на розгляд адмін комісії "
            },
            {
                "name": "63.   Якщо особа стосовно якої складається протокол не володіє українською мовою то",
                "value": "Відповідь – протокол складається українською мовою за участю перекладача "
            },
            {
                "name": "64.   Який час необхідно вказувати в протоколі про адмін затримання особи в разі доставлення правопорушника до органу Нац поліції",
                "value": "Відповідь – час фактичного затримання "
            },
            {
                "name": "65.   Яку інформацію необхідно зазначити в протоколі про адмін правопорушення в графі мсце його складання ",
                "value": "Відповідь – назва району та вулиці "
            }
        ]
    },
    {
        "libName": "Земельне та аграрне право, студенти 5  курс, 2023/2024 н.р.",
        "answers": [
            {
                "name": "Чим регулюються земельні відносини?",
                "value": "Конституцією України, Земельним кодексом України, а також прийнятими відповідно до них нормативно-правовими актами;"
            },
            {
                "name": "Система земельного права містить інститут?",
                "value": "юридичної відповідальності за порушення земельного законодавства;"
            },
            {
                "name": "Система земельного права — це?",
                "value": "сукупність правових інститутів, кожен з яких складається з групи юридичних норм, що регулюють однорідні земельні відносини;"
            },
            {
                "name": "Під принципами земельного права розуміють?",
                "value": "керівні засади у земельному законодавстві, що виражають сутність норм"
            }
        ]
    }
]
