[
    {
      "name": "165. Справа про адміністративне правопорушення, передбачене статтею 185-7 КУпАП, розглядається:",
      "value": "у триденний строк"
   },
   {
      "name": "3 якого віку настає відповідальність за злісну непокору законному розпорядженнюабо вимозі поліцейського:",
      "value": "з 16 років"
   },
   {
      "name": "3 якого віку настає відповідальність за злісну непокору законному розпорядженню або вимозі поліцейського:",
      "value": "з 16 років"
   },
   {
      "name": "3 якого віку настає відповідальність фізичних осіб за вчинення правопорушень, що посягають на здійснення народного волевиявлення:",
      "value": "з 16 років"
   },
   {
      "name": "38. Якщо особа оспорює факт вчинення правопорушення, поліцейський:",
      "value": "складає протокол про адміністративне правопорушення"
   },
   {
      "name": "Іноземці і особи без громадянства, які перебувають на території України, підлягають адміністративній відповідальності:",
      "value": "на загальних підставах з громадянами України"
   },
   {
      "name": "Інтереси особи, яка притягається до адміністративної відповідальності, які є неповнолітніми особами:",
      "value": "мають право представляти їх  законні представники батьки, опікуни, піклувальники"
   },
   {
      "name": "Адміністративна відповідальність настає за наявністю таких підстав:",
      "value": "нормативних, фактичних, документальних"
   },
   {
      "name": "Адміністративне затримання особи може бути застосовано поліцією до правопорушника, який вчинив:",
      "value": "правопорушення, які зазначені у статті 262 КУпАП"
   },
   {
      "name": "Адміністративне затримання особи, яка вчинила дрібне хуліганство, може тривати не більш як?",
      "value": "3 години"
   },
   {
      "name": "Адміністративне затримання особи, яка не виконала законне розпорядження або вимогу поліцейського, може тривати не більш:",
      "value": "3 годин"
   },
   {
      "name": "Адміністративне затримання особи, яка не виконала законне розпорядженняабо вимогу поліцейського, може тривати не більш:",
      "value": "3 години"
   },
   {
      "name": "Адміністративне правопорушення за статтею 178 КУпАП посягає на:",
      "value": "громадський порядок, людську гідність та громадську мораль"
   },
   {
      "name": "Адміністративне стягнення за вчинення адміністративного правопорушення за ознаками ст. 51 КУпАП може бути накладено не пізніш як через:",
      "value": "три місяціз дня вчинення правопорушення"
   },
   {
      "name": "Адміністративне стягнення за зайняття проституцією накладається:",
      "value": "адміністративною комісією"
   },
   {
      "name": "Адміністративне стягнення за правопорушення, яке віднесено до компетенції Національної поліції може бути накладено:",
      "value": "не пізніш як через два місяці з дня вчинення правопорушення, а при триваючому правопорушенні - не пізніш як через два місяці з дня його виявлення"
   },
   {
      "name": "Адміністративним правопорушенням (проступком) визнається протиправна, винна (умисна або необережн дія чи бездіяльність:",
      "value": "за яку законом передбачено адміністративну відповідальність"
   },
   {
      "name": "Адміністративну відповідальність за правопорушення у сфері забезпечення безпеки дорожнього руху, зафіксовані в автоматичному режимі:",
      "value": "несуть юридичні та фізичні особи, за якими зареєстровано транспортний засіб"
   },
   {
      "name": "В який строк розглядається справа про адміністративне правопорушення за статтею 174 КУпАП:",
      "value": "у п'ятнадпятиденний строк"
   },
   {
      "name": "В якому процесуальному документі фіксується застосування заходу забезпечення провадження:",
      "value": "протокол про адміністративне затримання"
   },
   {
      "name": "Відповідно до КУпАП крайня необхідність це:",
      "value": "обставина, що виключає адміністративну відповідальність"
   },
   {
      "name": "Визначте невеликий розмір наркотичного засобу \"канабіс\" (цілі або різного ступеня подрібнення будь-які частини рослини роду коноплі або їх суміш):",
      "value": "до 5 гр."
   },
   {
      "name": "Визначте обставини, які обтяжують відповідальність за вчинення правопорушенняпередбаченого статтею 180 (Доведення неповнолітнього до стану сп'яніння):",
      "value": "- усі відповіді вірні"
   },
   {
      "name": "Визначте строк розгляду скарги на постанову по справі про адміністративне правопорушення:",
      "value": "протягом  десяти днів з дня винесення постанови"
   },
   {
      "name": "Визначте строк розгляду справ про адміністративні правопорушення передбачені ст. 51 КУпАП:",
      "value": "у п'ятиденний строк"
   },
   {
      "name": "Визначте суб'єкта адміністративної відповідальності за статтею 180-1 КУпАП:",
      "value": "посадові особи закладу незалежно від форми власності або громадяни - власники закладу чи уповноважені ними особи"
   },
   {
      "name": "Для відбиття нападу та знешкодження тварин допускається використання:",
      "value": "пристроїв для відстрілу патронів, споряджених гумовими чи аналогічними за своїми властивостями метальними снарядами несмертельної дії, електрошокерів"
   },
   {
      "name": "Для проведення передвиборної агітації законом забороняється:",
      "value": "використання приміщень органів державної впали та органів місцевого самоврядування"
   },
   {
      "name": "Для того щоб правопорушення могло були кваліфіковане, як дрібне викрадення чужого майна у 2021, сумма викраденого майна не повинна перевищувати?",
      "value": "227,00 грн."
   },
   {
      "name": "До адміиістративних правопорушень з матеріальним складом належать:",
      "value": "міститься така ознака, як настання шкідливих матеріальних наслідків діяння"
   },
   {
      "name": "До елементів юридичного складу адміністративного правопорушення належать:",
      "value": "об'єкт, об'єктивна сторона, суб'єкт, суб'єктивна сторона"
   },
   {
      "name": "До обов'язкових ознак об'єктивної сторони адміністративного правопорушення належить:",
      "value": "противоправне діяння (дія чи бездіяльність)"
   },
   {
      "name": "Дозвільна система, що здійснюється органами внутрішніх справ, не поширюється на:",
      "value": "електронну зброю"
   },
   {
      "name": "Документ шо засвідчує факт створення або припинення юридичної особи, набуття або позбавлення статусу підприємця фізичною особою, відсутність якого є складом статті 164 КУпАП, є:",
      "value": "- виписка з Єдиного державного реєстру"
   },
   {
      "name": "Доставления порушника має бути проведено в такі строки:",
      "value": "не більше 1-ї години"
   },
   {
      "name": "</i>Доставлення порушника застосовується працівником поліції з метою:",
      "value": "сладення протоколу про адміністративне правопорушення в разі неможливості скласти його на місці вчинення правопорушення, якщо складення протоколу є обов'язковим."
   },
   {
      "name": "Дрібне викрадення чужого майна здійснюється шляхом:",
      "value": "крадіжки, шахрайства, привласнення чи розтрати"
   },
   {
      "name": "З якого віку настає відповідальність за вчинення правопорушення передбаченого ст. 173-2:",
      "value": "з 16 років"
   },
   {
      "name": "З якого віку настає відповідальність за куріння у заборонених місцях:",
      "value": "з 16 років"
   },
   {
      "name": "З якого віку настає відповідальність за незаконне виробництво, придбання, зберігання, перевезення, пересилання наркотичних засобів або психотропних речовин без мети збуту в невеликих розмірах:",
      "value": "16 років"
   },
   {
      "name": "З якого віку настає відповідальність за порушення правил тримання собак і котів:",
      "value": "з 16 років"
   },
   {
      "name": "За вчинення яких адміністративних правопорушень, передбачено адміністративне затримання:",
      "value": "дрібне хуліганство"
   },
   {
      "name": "За незаконний посів або незаконне вирощування снотворного маку чи конопель настає відповідальність за:",
      "value": "ст. 106-2 КУпАП"
   },
   {
      "name": "За порушення правил, норм і стандартів, що стосується забезпечення безпеки дорожнього руху військовослужбовці, військовозобов'язані та резервісти під час проходження зборів, а також особи Національної поліції:",
      "value": "несуть адміністративну відповідальність на загальних підставах"
   },
   {
      "name": "За продаж товарів зі складів, баз, підсобних приміщень підприємств на порушення встановлених правил, а так само приховування товарів від покупціввстановлюєтьсяадміністративна відповідальність:",
      "value": "ч.2 статті 155 КУпАП"
   },
   {
      "name": "За результатами розгляду справи про адміністративне правопорушення поліцейськими приймається рішення:",
      "value": "виноситься постанова про накладення адміністративного стягнення"
   },
   {
      "name": "За якою статтею КУпАП настає відповідальність за придбання, зберігання,перевезення наркотичних засобів або психотропних речовин без мети збуту в невеликих розмірах:",
      "value": "ст. 44"
   },
   {
      "name": "Заходи впливу щодо неповнолітніх осіб, які визначені у статті 24-1 КУпАП можуть застосовуватись:",
      "value": "виключно судом"
   },
   {
      "name": "Знаходження в розважальних та ресторанних закладах неповнолітнім в нічний час без супроводу батьків або інших законних представників забороняється:",
      "value": "особам, які не досягли 16 років"
   },
   {
      "name": "Ліцензії на право роздрібної торгівлі алкогольними напоями і тютюновими виробами видаються на:",
      "value": "на один рік"
   },
   {
      "name": "Місцями для стрільби з вогнепальної чи холодної метальної зброї, пристроїв для відстрілу патронів в населених пунктах є:",
      "value": "тири, стрільбиша, мисливські угіддя"
   },
   {
      "name": "На який строк може бути затримано особа за скоєння дрібного викрадення чужого майна?",
      "value": "до 3 годин"
   },
   {
      "name": "Не відноситься до завдань поліції  під час здійснення народного волевиявлення:",
      "value": "охорона та супровід  членів виборчої дільниці на час виборів"
   },
   {
      "name": "Не дозволяється приводити тварин до об'єктів господарського харчування у приміщення магазинів і кафе окрім:",
      "value": "собак - поводарів"
   },
   {
      "name": "Неповнолітній може бути притягнутий до адміністративної відповідальності за порушення правил торгівлі:",
      "value": "за статтею 155 КУпАП на підставі статті 24-1 КУпАП"
   },
   {
      "name": "Об'єктивну сторону правопорушення передбаченого статтею 181 КУпАП, становлять:",
      "value": "ворожіння на будь-чому у громадських місцях за винагороду"
   },
   {
      "name": "Об'єктивну сторону правопорушення, передбаченого статтею 180 КУпАП становлять:",
      "value": "сам факт доведенн неповнолітнього до стану сп'яніння повнолітньою особою"
   },
   {
      "name": "Об'єктом дрібного хуліганства є:",
      "value": "нецензурна лайка в громадських місцях, образливе чіпляння до громадян і інші подібні дії. що порушують громадський порядок і спокій громадян"
   },
   {
      "name": "Об'сктнвною стороною правопорушення за статтею 173-1 КУпАП передбачено діяння:",
      "value": "поширювання неправдивих чуток про замінування залізничного вокзалу"
   },
   {
      "name": "Обовязковою ознакою об'єктивної сторони правопорушення, яке кваліфікується за статтею 181-1 КУпАП, є:",
      "value": "винагорода за надання сексуальних послуг"
   },
   {
      "name": "Органи місцевого самоврядування в межах відповідної адміністративної території на підставі закону:",
      "value": "мають право заборонити або обмежити споживання пива (крім пива у пластиковій тарі), алкогольних, слабоалкогольних напоїв, вин столових та куріння тютюнових виробів під час проведення масових заходів"
   },
   {
      "name": "Осіб, які порушили правили обігу наркотичних засобів і психотропних речовин, може бути затримано:",
      "value": "на строк до трьох годин для складення протоколу, а в необхідних випадках для встановлення особи, проведения медичного огляду, з'ясування обставин придбання вилучених наркотичних засобів і психотропних речовин та їх дослідження - до трьох діб з повідомленням про це письмово прокурора протягом двадцяти чотирьох годин з моменту затримання"
   },
   {
      "name": "Особистий огляд правопорушника відповідно до статті 264 КУпАП:",
      "value": "проводиться уповноваженою на те посадовою особою однієї статі з оглядуваним і в присутності двох понятих тієї самої статі"
   },
   {
      "name": "Під час вигулу супроводжувати собаку може особа, яка досягла:",
      "value": "14-річного віку"
   },
   {
      "name": "Під час проведення масових заходів за статтею 185-7 КУпАП кваліфікується протиправні діяння:",
      "value": "поширення завідомо неправдивих відомостей з метою провокації і злісної непокори законній вимозі поліцейського"
   },
   {
      "name": "Патрульні наряди при виконані своїх завдань з охорони громадського порядку повинні вживати заходів до захисту від противоправних посягань:",
      "value": "державної, комунальної, приватної власності"
   },
   {
      "name": "Перебування доставленої особа за вчинення дрібного хуліганства у штабі громадського формування може тривати:",
      "value": "- не більше 1 години"
   },
   {
      "name": "Перебування доставленої особи у штабі громадського формування з охорони громадського порядку чи громадському пункі з охорони громадського порядку:",
      "value": "не може тривати більш як одну годину"
   },
   {
      "name": "Передвиборна агітація закінчується:",
      "value": "о 24 годині останьої п'ятниці перед  днем виборів"
   },
   {
      "name": "Передвиборна агітація розпочинається з моменту:",
      "value": "прийняття ЦВК рішення про реєстрацію кандидатів у народні депутати"
   },
   {
      "name": "Перелік місць, в яких заборонено споживання пива (крім безалкогольного), алкогольних та слабоалкогольних напоїв, вин столових визначається:",
      "value": "законодавчим актом та рішенням органів місцевого самоврядування"
   },
   {
      "name": "Поліцейський зобов'язаний при складанні протоколу про адміністративне правопорушення роз'яснити особі його права, передбачені статтею 63 Конституції України. Про що йдеться в цій статті Конституції України?",
      "value": "Особа не несе відповідальності за відмову давати показання або пояснення щодо себе, членів сім'ї чи близьких родичів"
   },
   {
      "name": "Поліцейський зобов'язаний при складанні протоколу про адміністративне правопорушення роз'яснити особі його права, передбачені статтею 55 Конституції України. Про що йдеться в цій статті Конституції України?",
      "value": "Кожному гарантується право на оскарження в суді рішень, дій чи бездіяльності органів державної влади, органів місцевого самоврядування, посадових і службових осіб"
   },
   {
      "name": "Поліцейський не має права накладати адміністративні стягнення на таких осіб:",
      "value": "осіб віком від 16 до 18 років"
   },
   {
      "name": "Поліцейським за крадіжку  з супермаркету вартістю 454 грн. затриманоособу.  До якого виду юридичної відповідальності вона може бути притягнута?",
      "value": "кримінальної"
   },
   {
      "name": "Поліцейським за крадіжку пляшки коньяку вартістю 220 грн. 10.01.2021 року затриманий військовослужбовець Зброїних Сил України. До якого виду юридичної відповідальності він може бути притягнутий?",
      "value": "дисциплінарної"
   },
   {
      "name": "Постанова по справі про адміністративне правопорушення оголошується:",
      "value": "негайно після закінчення розгляду справи"
   },
   {
      "name": "Потерпілим є особа, якій адміністративним правопорушенням заподіяно моральну, фізичну або майнову шкоду. Статус потерпілого визначається статтею 269 КУпАП. Одночасно:",
      "value": "потерпілого може бути опитано як свідка відповідно до статті 272 КУпАП"
   },
   {
      "name": "Предмет посягання відповідно до ст. 51 КУпАП:",
      "value": "будь-яке майно"
   },
   {
      "name": "При вилученні предметів торгівлі у невстановлених місцях складається:",
      "value": "відмітки про вилучення вносяться до протоколу про адміністративне правопорушення"
   },
   {
      "name": "При виявленні фактів знаходження в розважальних та ресторанних закладахнеповнолітнього в нічний час без супроводу батьків або інших законнихпредставниківполіцейським складається протокол про адміністративне правопорушення на:",
      "value": "посадових осіб закладу незалежно від форми власності або громадян - власників закладу чи уповноважених ними осіб"
   },
   {
      "name": "При розгляді справ про адміністративні правопорушення, передбачені статтями 51 (дрібне викрадення чужого майн, 173 (дрібне хуліганство) КУпАП:",
      "value": "присутність особи, яка притягається до адміністративної відповідальності  є обов'язковою"
   },
   {
      "name": "Притягнення до адміністративної відповідальності можливо:",
      "value": "тільки в результаті вчинення адміністративного проступку"
   },
   {
      "name": "Про адміністративне затримання:",
      "value": "складається протокол"
   },
   {
      "name": "Про місце перебування особи, затриманої за вчинення адміністративного правопорушення:",
      "value": "негайно повідомляються її родичі, а на її прохання також власник відповідного підприємства, установи, організації або уповноважений ним орган"
   },
   {
      "name": "Про накладення якого адміністративного стягнення може прийняти рішення офіцер поліції:",
      "value": "штраф"
   },
   {
      "name": "Про проведения особистою огляду й огляду речей:",
      "value": "складається протокол або про це робиться відповідний запис у протоколі про адміністративне правопорушення чи в протоколі про адміністративне затримання"
   },
   {
      "name": "Проведення ремонтних робіт, що супроводжуються шумом, забороняється у робочі дні:",
      "value": "з 21-00 до 8-00 години"
   },
   {
      "name": "Продавець алкогольних напоїв або тютюнових виробів, з метою встановлення віку покупця,має право:",
      "value": "- вимагати у покупця, який купує алкогольні напої або тютюнові вироби паспортний документ"
   },
   {
      "name": "Протокол про адміністративне затримання:",
      "value": "підписується посадовою особою, яка його склала і затриманим<i>"
   },
   {
      "name": "Протокол про адміністративне правопорушення є недійсним без підпису:",
      "value": "поліцейського"
   },
   {
      "name": "Протокол про адміністративне правопорушення віднесено до:",
      "value": "документальних підстав адміністративної відповідальності"
   },
   {
      "name": "Протокол про адміністративне правопорушення передбачене ст. 51 КУпАП розглядається за місцем:",
      "value": "вчинення правопорушення"
   },
   {
      "name": "Протокол про адміністративне правопорушення передбачене статтею 106-1 КУпАП складається:",
      "value": "у двох примірниках"
   },
   {
      "name": "Протоколи про правопорушення, передбачені статтею 173-2 розглядають:",
      "value": "районні, районі у місті, міські чи міськрайоні суди (судді)"
   },
   {
      "name": "Процесуальним документом про факт вчинення діяння, містить ознаки правопорушення, передбаченого КУпАП, є:",
      "value": "протокол"
   },
   {
      "name": "Санкція ч.2 статті 154 КУпАП передбачає:",
      "value": "штраф с конфіскацією тварини"
   },
   {
      "name": "Серед зазначених заходів знайти захід, який не відноситься до заходів забезпечення провадження:",
      "value": "доставлення правопорушника"
   },
   {
      "name": "Серед перерахованих заходів НЕ є заходами забезпеченим провадженим в справах про адміністративні правопорушення:",
      "value": "застосування засобів примусової зупинки транспортного засобу"
   },
   {
      "name": "Скаргу на постанову по справі про адміністративне і правопорушення може бути подано протягом:",
      "value": "десяти днів з дня винесення постанови"
   },
   {
      "name": "Складом правопорушення, передбаченого статтею 160 КУпАП, є:",
      "value": "торгівля у невстановлених місцях"
   },
   {
      "name": "Справа про адміністративне правопорушення за статтею 180-1 КУпАП розглядається:",
      "value": "у п'ятнадцятиденний строк"
   },
   {
      "name": "Справа про адміністративне правопорушення за статтею 185 КУпАП розглядається:",
      "value": "протягом доби"
   },
   {
      "name": "Справа про адміністративне правопорушення за статтею 185 КУпАП розглядається:",
      "value": "протягом доби"
   },
   {
      "name": "Справа про адміністративне правопорушення передбачене статтею 173 КУпАП розглядається:",
      "value": "- протягом доби"
   },
   {
      "name": "Справа про адміністративне правопорушення передбачене статтею 44 КУпАП розглядається:",
      "value": "за місцем вчинення правопорушення"
   },
   {
      "name": "Справа про адміністративне правопорушення, передбачене статтею 185-7 КУпАП, розглядається:",
      "value": "протягом доби"
   },
   {
      "name": "Справа про торгівлю з рук у невстановлених місцях розглядається:",
      "value": "судом у триденний строк"
   },
   {
      "name": "Справи про адміністративні правопорушення, що посягають на здійснення народного волевиявлення, розглядається:",
      "value": "судом"
   },
   {
      "name": "Справи про адміністративні правопорушення, що посягають на здійснення народного волевиявлення, розглядаються: _____\n28",
      "value": "в триденний строк"
   },
   {
      "name": "Справи про доведення неповнолітнього до стану сп'яніння (крім батьків неповнолітніх або осіб, які їх замінюють) розглядаються:",
      "value": "адміністративною комісією"
   },
   {
      "name": "Справу про адміністративне правопорушення щодо публічних закликів до невиконання розпоряджень або вимог поліцейського у зв'язку з виконанням ним обов'язків по охоронігромадського порядку розглядають:",
      "value": "суд"
   },
   {
      "name": "Справу про адміністративне правопорушення, передбачене статтею 185 КУпАП, розглядають:",
      "value": "суд"
   },
   {
      "name": "Строк адміністративного затримання обчислюється з моменту:",
      "value": "фактичного затримання особи"
   },
   {
      "name": "Строками про адміністративне правопорушення та статтею 173 КУпАП розглядається:",
      "value": "протягом доби"
   },
   {
      "name": "Суб'єктивна  сторона правопорушення вередбаченого ст. 51 КУпАП характеризується наявністю:",
      "value": "вини у формі прямого умислу"
   },
   {
      "name": "Суб'єктивна сторона адміністративного правопорушення характеризується:",
      "value": "виною, яка проявляється у формі умислу або необережності"
   },
   {
      "name": "Суб'єктом адміністративної відповідальності за ст. 174 КУпАП може бути особа:",
      "value": "яка досягла на момент вчинення адміністративного правопорушення 16-річного віку"
   },
   {
      "name": "Суб'єктом відповідальності за статтею 195 КУпАП є:",
      "value": "працівники підприємств, установ, організацій, відповідальні за охорону зброї та бойових припасів"
   },
   {
      "name": "Суб'єктом правопорушення, передбаченого статтею 180 КУпАП не можуть бути:",
      "value": "продавці, які продали неповнолітньому алкогольні напої"
   },
   {
      "name": "Термін адміністративного затримання за незаконне виробництво, придбання, зберігання, перевезення, пересилання наркотичних засобів або психотропних речовин без мети збуту в невеликих розмірах:",
      "value": "до 3-х діб"
   },
   {
      "name": "Тимчасове затримання транспортного засобу уповноваженою особам територіального, у тому числі міжрегіонального органу патрульної служби проводиться у випадках, передбачених статтею 265-2 КУпАП зокрема у разі:",
      "value": "коли неможливо усунути причину затримання на місці виявлення адміністративного правопорушення"
   },
   {
      "name": "У випадку, коли затриманий потребує медичної допомоги, зазначаються:",
      "value": "час її надання, номер бригади швидкої медичної допомоги, прізвище та ініціали лікаря, до якого закладу охорони здоров'я направлено затриманого"
   },
   {
      "name": "У разі виявлення  факту проведення  передвиборної  агітації в день виборів  або референдуму, поліцейський уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "У разі виявлення порушення правил вигулу домашніх тварин поліцейський уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд адміністративної комісії"
   },
   {
      "name": "У разі виявлення порушення правил торгівлі громадянами, які займаються  підприємницькою діяльністю, працівник поліції уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд адміністративній комісії"
   },
   {
      "name": "У разі виявлення факту вчинення дрібного хуліганства уповноважені поліцейські зобов'язані:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "У разі виявлення факту куріння тютюнових виробів у місцях, заборонених вчиненірішенням відповідної сільської, селищної, міської ради, поліцейський уповноважений:",
      "value": "винести постанову про накладення штрафу"
   },
   {
      "name": "У разі виявлення факту порушення встановленого законом порядку перебування дітей у закладах, у яких провадиться діяльність у сфері розваг, або закладах громадського харчування, уповноважений поліцейський має право:",
      "value": "скласти протокол, винести постанову"
   },
   {
      "name": "У разі виявлення факту поширення неправдивих чуток уповноважені поліцейські зобов'язані:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "У разі виявлення факту торгівлі з рук у невстановлених місцях, поліцейський уповноважений:",
      "value": "- скласти протокол про адміністративне правопорушення, застосувати адміністративне затримання з оглядом та вилученням предметів торгівлі, надіслати матеріали справи до суду"
   },
   {
      "name": "У разі вчинення злісної непокори законному розпорядженню або вимозі поліцейського, неповнолітній:",
      "value": "скласти протокол на неповнолітнього за статтею 185 КУпАП"
   },
   {
      "name": "У разі заподіяння шкоди здоров'ю людей їх майну внаслідок порушення правил утримання собак і котів, справа про адміністративне правопорушення за статтею 154 КУпАП розглядається:",
      "value": "судом"
   },
   {
      "name": "У разі прояву злісної непокори законному розпорядженню або вимозіполіцейського під час виконання службових обов'язків, поліцейський уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "У разі прояву злісної непокори законному розпорядженню або вимозі поліцейськогонеповнолітньою особою віком 16 років, поліцейський має ораво:",
      "value": "скласти протокол на неповнолітнього за статтею 185 КУпАП"
   },
   {
      "name": "У разі прояву злісної непокори законному розпорядженню або вимозі поліцейського неповнолітньою особою віком до 16 років, поліцейські уповноважені:",
      "value": "скласти протокол на одного з батьків за ч. З стаз іі 184 КУпАП"
   },
   {
      "name": "У разі прояву злісної непокори законному розпорядженню або вимозіоліцейського неповнолітньою особою віком до 16 років, уповноважений поліцейський маєправо:",
      "value": "скласти протокол на одного з батьків за статтею 185 КУпАП"
   },
   {
      "name": "У разі публічних закликів до невиконання розпоряджень або вимог поліцейського у зв'язкуз виконанням ним обов'язків по охороні громадського порядку, gоліцейський уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "У разі публічних закликів до невиконання розпоряджень або вимог поліцейського у зв'язку з виконанням ним обов'язків но охороні громадського порядку, поліцейський уповноважений:",
      "value": "скласти протокол про адміністративне правопорушення та передати на розгляд суду"
   },
   {
      "name": "Хто мас право складати протоколи та виносити постанови за куріння у заборонених місцях:",
      "value": "співробітники Національної поліції"
   },
   {
      "name": "Хто розглядає адміністративну справу про поширення неправдивих чуток:",
      "value": "суд"
   },
   {
      "name": "Хто розглядає справу про адміністративне правопорушення передбачене ст.44 КУпАП:",
      "value": "суд, орган Національної поліції"
   },
   {
      "name": "Чи звільняється особа, що добровільно здала наркотичні засоби або психотропні речовини, які були у неї в невеликих розмірах від адміністративної відповідальності:",
      "value": "так"
   },
   {
      "name": "Чи має право керівник територіального органу Національної поліції дати дозвіл на продовження строків адміністративного затримання особи додатково на 3 години?",
      "value": "таких повноважень не має"
   },
   {
      "name": "Як має діяти поліцейський в разі виявлення адміністративного правопорушення в сфері забезпечення безпеки дорожнього руху, розгляд якого віднесено до компетенції Національної поліції, якщо правопорушник є неповнолітньою особою (17 рокі?",
      "value": "Скласти протокол про адміністративне правопорушення."
   },
   {
      "name": "Які ігри відносяться відповідно до закону до азартних:",
      "value": "гра в рулетку, більярд на гроші, речі та інші цінності"
   },
   {
      "name": "Які ігри відносяться відповідно до закону до азартних:",
      "value": "гра в карти на гроші, речі та інші цінності"
   },
   {
      "name": "Які дії вважаються виконанням поліцейським службових обов'язків з охорони громадського порядку:",
      "value": "несення постової чи патрульної служби з охорони громадського порядку"
   },
   {
      "name": "Які обставини обтяжують відповідальність за самоправне зайняття житлового приміщення:",
      "value": "усі відповіді вірні"
   },
   {
      "name": "Які правопорушення, не належать до тих, що посягають на громадський порядокі громадську безпеку:",
      "value": "незаконний посів або незаконне вирощування снотворного маку чи конопель"
   },
   {
      "name": "Які протиправні діяння кваліфікуються як дрібне хуліганство за статтею 173 КУпАП:",
      "value": "докучлива, груба, розв'язна поведінка в громадському місці з мстою прояву звеваги до суспільства, честі та гідності людини, що може супроводжуватись нецензурною лайкою"
   },
   {
      "name": "Які протиправні діяння кваліфікуються як злісна непокора законному розпорядженню або вимозі поліцейського за статтею 185 КУпАП:",
      "value": "особа вперто не бажає виконувати розпорядження або дотримуватись вимоги поліцейського припинити правопорушення"
   },
   {
      "name": "Які протиправні діяння кваліфікуються як злісна непокора законному розпорядженню або вимозі поліцейського за статтею 185 КУпАП :",
      "value": "особа вперто не бажає виконувати розпорядження або дотримуватись вимоги поліцейського припинити правопорушенні"
   },
   {
      "name": "Які процесуальні документи за змістом і функціями НЕ належать до документів, що фіксують фактичні обставини у справах про адміністративні правопорушення?",
      "value": "висновок експерта"
   },
   {
      "name": "Які процесуальні документи за змістом і функціями НЕ належать до документів, що забезпечують провадження у справах про адміністративні правопорушення?",
      "value": "протокол про адміністративне правопорушення"
   },
   {
      "name": "Які процесуальні документи за змістом не належать до документів, які є формою рішення суб'єктів адміністративно-процесуальної діяльності у справах про адміністративні правопорушення?",
      "value": "протокол про адміністративне затримання"
   },
   {
      "name": "Які суб'єкти не забовязані підписати протокол про адміністративне правопорушення, але мають право на це?",
      "value": "правопорушник"
   },
   {
      "name": "Яка кількість виправлень у протоколі про адміністративне правопорушення є допустимою?",
      "value": "такі виправлення не допускаються"
   },
   {
      "name": "Яка ознака хуліганських дій. що вчиняються в громадських місцях, дозволяє кваліфікувати їх як кримінальне правопорушення за ч. 1 ст. 296 КК України:",
      "value": "особлива зухвалість чи винятковій цінізм правопорушника"
   },
   {
      "name": "Яка стаття КУпАП передбачає відповідальність за вчинення насильства в сім'ї?",
      "value": "ст. 173-2"
   },
   {
      "name": "Яка стаття КУпАП передбачає відповідальність за невжиття заходів шодо забезпечення охорони посівів снотворного маку чи конопель, місць їх зберігання та переробки:",
      "value": "ст. 106-1"
   },
   {
      "name": "Яка стаття КУпАП передбачає відповідальність за стрільбу з вогнепальної, холодної метальної, пневматичної зброї у населених пунктах:",
      "value": "ст. 174"
   },
   {
      "name": "Яка стаття КУпАП передбачає відповідальність за ухилення від медичного огляду чи медичного обстеження:",
      "value": "ст. 44-1"
   },
   {
      "name": "Який документ засвідчує реєстрацію домашньої тварини:",
      "value": "реєстраційне посвідчення та номерній індивідуальний знак (жетон)"
   },
   {
      "name": "Який документ не належить до джерел доказів у справах про адміністративні правопорушення:",
      "value": "рапорт про адміністративне затримання"
   },
   {
      "name": "Який захід забезпечення провадження застосовуються як КРАЙНІЙ для припинення правопорушень за статтями 185,185-7 КУпАП:",
      "value": "адміністративне затримання"
   },
   {
      "name": "Який орган уповноважений розглядати справу про адміністративне правопорушення, передбачене ст. 51 КУпАП?",
      "value": "суд"
   },
   {
      "name": "Який процесуальний документ є доказом у справі про адміністративне правопорушення:",
      "value": "пояснення особи"
   },
   {
      "name": "Який процесуальний документ є формою рішення у справі про адміністративні правопорушення:",
      "value": "постанова"
   },
   {
      "name": "Який строк розгляду справи про адміністративне правопорушення за статтею 154 КУпАП:",
      "value": "у п'ятнадцятиденний строк"
   },
   {
      "name": "Який строк розгляду справи про адміністративне правопорушення за статтею 155 КУпАП:",
      "value": "у п'ятнадцятиденний строк"
   },
   {
      "name": "Який термін розгляду спряв про адміністративні правопорушення,передбачені частиною першою статті 44, статтями 44-1,106-1,106-2 КУпАП:",
      "value": "протягом доби"
   },
   {
      "name": "Який час необхідно вказувати в протоколі про адміністративне затримання особи в різі доставлення правопорушника до органу Національної поліції?",
      "value": "час фактичного затримання особи"
   },
   {
      "name": "Яких захід забезпечення провадження застосовується як крайній для припинення правопорушеньза статтями 185,185-7 КУпАП:",
      "value": "адміністративне затримання"
   },
   {
      "name": "Яку інформацію необхідно зазначити в протоколі про адміністративне правопорушення в графі \"місце його складання\"?",
      "value": "назва населеного пункту"
   },
   {
      "name": "Якщо в тексті протоколу зроблено виправлення, поліцейський:",
      "value": "заповнює новий бланк протоколу та доповідає рапортом керівнику підрозділу про підстави виправлення"
   },
   {
      "name": "Якщо неповнолітній віком до 16 років продає пачки сигарет на вулиці, дільничний офіцер поліції уповноважений:",
      "value": "- скласти протокол на батьків за ч.З ст.  184 КУпАП"
   },
   {
      "name": "Якщо неповнолітня особа курить тютюнові вироби у заборонених законом місцях,справа про адміністративне правопорушення розглядається:",
      "value": "судом"
   },
   {
      "name": "Якщо особа є суб'єктом права на безоплатну вторинну правову допомогу, у розгляді справи про адміністративне правопорушення може брати участь адвокат:",
      "value": "який призначений Центром з надання безоплатної вторинної правової допомоги"
   },
   {
      "name": "Якщо особа двічі протягом року піддавалась адміністративному стягненню за розпивання спиртних напоїв або появу в п'яному вигляді, поліцейський:",
      "value": "складає протокол про адміністративне правопорушення та передає на розгляд суду"
   },
   {
      "name": "Якщо особа, стосовно якої складається протокол, не володіє ; українською мовою, то:",
      "value": "протокол складається українською мовою за участю перекладача"
   },
   {
      "name": "Якщо особа, яка притягується до відповідальності, відмовляється підписувати протокол, але згодна дати пояснення на окремому аркуші з причин такої відмови, то поліцейським:",
      "value": "пояснення складається, додається до протоколу"
   },
    {
      "name": "Адміністративна юрисдикція поділяється на такі види:",
      "value": "адміністративно-регулятивну, адміністративно деліктну та адміністративно-судочинну;"
   },
   {
      "name": "В якій статті глави 17 КУпАП зазначається підвідомчість справ про адміністративні правопорушення до органів Національної поліції:",
      "value": "Статті 222КУпАП;"
   },
   {
      "name": "В який термін може бути подано скаргу на постанову стосовно справи:",
      "value": "10 днів;"
   },
   {
      "name": "Вкажіть з чого розпочинається правильний порядок розгляду справи про адміністративне правопорушення передбачений статтею 279 КУпАП:",
      "value": "З оголошення складу колегіального органу або представлення посадової особи, яка розглядає дану справу;"
   },
   {
      "name": "Вкажіть зайвий нормативний документ який не відноситься до діяльності засобів масової інформації в частині контролю за НПУ:",
      "value": "Закон України Про корупцію;"
   },
   {
      "name": "Вкажіть зайвий принцип в діяльності поліції:",
      "value": "демократизму."
   },
   {
      "name": "Вкажіть методи АЮДНПУ:",
      "value": "метод переконання та примусу;"
   },
   {
      "name": "Вкажіть послідовність дій передбачених статтею 18 Закону України Про Національну поліцію - коли звертаючись до особи, або у разі звернення особи до поліцейського, поліцейський зобов'язаний:",
      "value": "Назвати своє прізвище, посаду, спеціальне звання та пред'явити на її вимогу службове посвідчення;"
   },
   {
      "name": "Вкажіть правильне визначення, що таке юрисдикція:",
      "value": "визначається як сукупність повноважень відповідних державних органів, вирішувати правові спори і справи про правопорушення;"
   },
   {
      "name": "Громадянин, який звернувся із заявою чи скаргою до підрозділу поліції превентивної діяльності, має права, визначені ст. 18 Закону України \"Про звернення громадян\":",
      "value": "всі відповіді вірно."
   },
   {
      "name": "Громадянину за наслідками розгляду його скарги надається:",
      "value": "письмова або усна відповідь;"
   },
   {
      "name": "Дисциплінарне стягнення  не може бути накладено,  якщо з дня вчинення  проступку  минуло:",
      "value": "більше півроку;"
   },
   {
      "name": "Дисциплінарне стягнення може бути оскаржене:",
      "value": "протягом трьох місяців з дня ознайомлення з наказом;"
   },
   {
      "name": "До основних принципів дисциплінарного провадження відносять:",
      "value": "законність, презумпцію невинуватості, рівність усіх перед законом, гласність та економічність;"
   },
   {
      "name": "До перевірки звернень громадян можуть залучатися за згодою:",
      "value": "представники громадськості."
   },
   {
      "name": "До перевірки звернень громадян можуть залучатися за згодою:",
      "value": "представники громадськості."
   },
   {
      "name": "За своїм внутрішнім переконанням, що ґрунтується на всебічному, повному і об'єктивному дослідженні всіх обставин справи  в  їх  сукупності,  керуючись законом і правосвідомістю орган чи посадова особа робить:",
      "value": "Оцінку доказі"
   },
   {
      "name": "Загальну систему поліції складають:",
      "value": "центральний орган управління поліцією та територіальні органи поліції."
   },
   {
      "name": "Закон України Про заходи щодо попередження та зменшення вживання тютюнових виробів і їх шкідливого впливу на здоров'я населення зазначає, що частина  (частини)  будь-якої  будівлі, споруди,  яка доступна або відкрита для населення  вільно, чи за запрошенням,  або за плату, постійно, періодично або час від часу, в тому числі під'їзди, а також підземні переходи, стадіони це є:",
      "value": "Громадське місце."
   },
   {
      "name": "Залежно від кількісного складу суб'єктів подання скарги поділяються на:",
      "value": "колективні та індивідуальні."
   },
   {
      "name": "Засоби адміністративного запобігання це:",
      "value": "усі відповіді вірні."
   },
   {
      "name": "Заходи припинення можна поділити на:",
      "value": "загальні та спеціальні."
   },
   {
      "name": "Звернення військовослужбовців, а також членів їх сімей вирішуються в термін:",
      "value": "до 15 днів з моменту подання заяви;"
   },
   {
      "name": "Звернення розглядаються і вирішуються в термін:",
      "value": "не більше одного місяця від дня їх отримання."
   },
   {
      "name": "Звернення які не потребують додаткового вивчення та проведення перевірки за ними, розглядаються у такий термін:",
      "value": "невідкладно, але не пізніше 15 днів від дня їх отримання."
   },
   {
      "name": "Згідно з чинним законодавством дисциплінарна відповідальність державних службовців, до яких належать і працівники Національної поліції України, настає за:",
      "value": "усі відповіді вірні."
   },
   {
      "name": "ЗУ \"Про Національну поліцію\" був прийнятий:",
      "value": "02 липня 2015 року;"
   },
   {
      "name": "Керівником та заступниками керівника поліції може бути призначена особа, яка:",
      "value": "всі відповіді вірні."
   },
   {
      "name": "Ким спрямовується та координується діяльність Національної поліції України:",
      "value": "Кабінетом Міністрів України та Міністра внутрішніх справ України;"
   },
   {
      "name": "Конституція України ст. 63 визначає \"близьких родичів\" до них відносимо:",
      "value": "подружжя, батьки (мати, батько) й дитина (діти), рідні брати і сестри, дід (бабуся) і онук (онука)."
   },
   {
      "name": "Не підлягають розгляду такі заяви:",
      "value": "особа яка визнана судом недієздатною;"
   },
   {
      "name": "Обраний поліцейський захід має бути:",
      "value": "законним, необхідним, пропорційним та ефективним;"
   },
   {
      "name": "Основними принципами провадження у справах про адміністративні правопорушення є:",
      "value": "усі відповіді вірні."
   },
   {
      "name": "Під час проведення превентивних поліцейських заходів поліція зобов'язана повідомити особі про причини застосування до неї превентивних заходів, а також довести до її відома нормативно-правові акти, на підставі яких застосовуються такі заходи:",
      "value": "Так зобов'язана;"
   },
   {
      "name": "Поліцейський захід-це:",
      "value": "це дія або комплекс дій превентивного або примусового характеру, що обмежує певні права і свободи людини та застосовується поліцейськими відповідно до закону для забезпечення виконання покладених на поліцію повноважень;"
   },
   {
      "name": "Поліцейський може застосовувати фізичну силу, у тому числі спеціальні прийоми боротьби (рукопашного бою), для:",
      "value": "всі відповіді вірні."
   },
   {
      "name": "Поліцейський при спілкуванні з громадянином повинен розмовляти з правопорушником:",
      "value": "Українською мовою;"
   },
   {
      "name": "Попередження як захід адміністративного стягнення може виноситься в усній формі:",
      "value": "Ні;"
   },
   {
      "name": "Посадові особи Національної поліції України, які компетентні приймати і розглядати скарги, в межах своїх повноважень зобов'язані:",
      "value": "забезпечувати поновлення порушених прав;"
   },
   {
      "name": "Принцип дотримання прав і свобод людини полягає:",
      "value": "у тому, що під час виконання своїх завдань поліція забезпечує дотримання прав і свобод людини, гарантованих Конституцією та законами України, а також міжнародними договорами України, згода на обов'язковість яких надана Верховною Радою України, і сприяє їх реалізації;"
   },
   {
      "name": "Рішення за розглядом скарги громадянина приймає:",
      "value": "керівник державного органу;"
   },
   {
      "name": "Скільки ви знаєте стадій провадження в адміністративних правопорушеннях:",
      "value": "чотири."
   },
   {
      "name": "Скарга - це :",
      "value": "звернення з вимогою про захист законних інтересів громадян, порушених діями (бездіяльністю), рішеннями державних органів, органів місцевого самоврядування;"
   },
   {
      "name": "У разі вчинення протиправних діянь поліцейські несуть:",
      "value": "кримінальну, адміністративну, цивільно-правову та дисциплінарну відповідальність;"
   },
   {
      "name": "У разі групового скоєння адміністративних правопорушень складаються:",
      "value": "протокол на кожного правопорушника окремо;"
   },
   {
      "name": "Фактичною підставою порушення дисциплінарного провадження є:",
      "value": "вчинення працівником поліції діяння, яке містить ознаки дисциплінарного проступку, але наявність фактичної підстави не завжди тягне за собою порушення справи;"
   },
   {
      "name": "Хто є суб'єктами адміністративних правопорушень, які посягають на громадський порядок:",
      "value": "фізичні осудні особи, які на момент учинення правопорушення досягли 16-річного віку;"
   },
   {
      "name": "Цілі поліції, які перебувають на службі у громади, включають:",
      "value": "усі відповіді правильні."
   },
   {
      "name": "Що є підставою для порушення справи про адміністративне правопорушення і підставою для настання адміністративною відповідальністю:",
      "value": "скоєння особою (як фізичною, так і юридичною) адміністративного правопорушення;"
   },
   {
      "name": "Що відноситься до діянь, які кваліфікуються як дрібне хуліганство ст.173 КУпАП:",
      "value": "Всі відповіді вірні"
   },
   {
      "name": "Що відноситься до обставин, що обтяжують відповідальність за адміністративне правопорушення:",
      "value": "Всі вищевказані відповіді підходять."
   },
   {
      "name": "Що не відноситься до адміністративних стягнень (стаття 24 КУпАП):",
      "value": "Конвоювання затриманого;"
   },
   {
      "name": "Що не відноситься до доказів згідно статті 251 КУпАП:",
      "value": "Свідчення поліцейського;"
   },
   {
      "name": "Що не відноситься до завдань Національної поліції України:",
      "value": "співпраця з громадськими організаціями, підприємствами, установами різних форм власності для захисту публічної безпеки і порядку;"
   },
   {
      "name": "Що не відноситься до загальних ознак взаємодії:",
      "value": "застосування превентивних методів переконання та примусу в разі виникнення підстав для їх застосування."
   },
   {
      "name": "Що не відноситься до обов'язкових умов, що засвідчують повноваження адвоката на участь у розгляді справи про адміністративне правопорушення згідно статті 271 КУпАП:",
      "value": "Усна домовленість сторін яка може відбутися при присутності поліцейського;"
   },
   {
      "name": "Що не відноситься до обставин що, виключають провадження в справі про адміністративне правопорушення (статті 247 КУпАП):",
      "value": "смерть близького родича (коло яких визначено законом);"
   },
   {
      "name": "Що не відноситься до обставин, що пом'якшують відповідальність за адміністративне правопорушення:",
      "value": "Зізнання правопорушника;"
   },
   {
      "name": "Що не відноситься до прав особи, яка притягається до адміністративної відповідальності (статті 268 КУпАП):",
      "value": "робити адміністративний відвід зацікавлених осіб;"
   },
   {
      "name": "Що не відноситься до превентивних поліцейських заходів передбачених статтею 31 Закону України Про Національну поліцію:",
      "value": "Поліцейський обшук;"
   },
   {
      "name": "Які обставини не повинен з'ясувати поліцейський при розгляді справи про адміністративні правопорушення згідно статті 280 КУпАП:",
      "value": "Чи  було вчинено дисціплінарне правопорушення;"
   },
   {
      "name": "Які питання вирішує посадова особа при підготовці до розгляду справи про адміністративне правопорушення (статті 278 КУпАП):",
      "value": "Всі відповіді вірні"
   },
   {
      "name": "Яка з наведених стадій провадження про адміністративні правопорушення є факультативною:",
      "value": "оскарження (опротестування) постанови у справі;"
   },
   {
      "name": "Яка стадія адміністративного провадження є початковою:",
      "value": "порушення справи про адміністративне правопорушення та адміністративне розслідування."
   },
   {
      "name": "Яка стаття КУпАП не відноситься до глави 14 в якій передбачувані адміністративні правопорушення, що посягають на громадський порядок і громадську безпеку:",
      "value": "Стаття 187. Порушення правил адміністративного нагляду."
   },
   {
      "name": "Яке з рішень не може бути прийняте пізніше 5 денного строку:",
      "value": "по письмовій вказівці прокуратури припинити розгляд звернення і передати іншому державному органу повідомивши заявника;"
   },
   {
      "name": "Яке одне із головних завдання поліції визначено європейськими країнами:",
      "value": "попередження злочинів;"
   },
   {
      "name": "Якої функції профілактики правопорушень не існує:",
      "value": "розпорядча функція;"
   },
   {
      "name": "Якого виду контролю з боку засобів масової інформації немає:",
      "value": "спостереження за діяльністю керівної ланки поліцейських органів з метою виявлення порушень законодавства, для забезпечення оптимального функціонування системи."
   },
   {
      "name": "Якщо справи про адміністративні правопорушення відповідно до статті 38 КУпАП підвідомчі суду (судді), стягнення може бути накладено не пізніш як:",
      "value": "Через три місяці з дня вчинення правопорушення;"
   },
    {
      "name": "Адміністративна юрисдикція поділяється на такі види:",
      "value": "адміністративно-регулятивну, адміністративно деліктну та адміністративно-судочинну;"
   },
   {
      "name": "В якій статті глави 17 КУпАП зазначається підвідомчість справ про адміністративні правопорушення до органів Національної поліції:",
      "value": "Статті 222КУпАП;"
   },
   {
      "name": "В який термін може бути подано скаргу на постанову стосовно справи:",
      "value": "10 днів;"
   },
   {
      "name": "Вкажіть з чого розпочинається правильний порядок розгляду справи про адміністративне правопорушення передбачений статтею 279 КУпАП:",
      "value": "З оголошення складу колегіального органу або представлення посадової особи, яка розглядає дану справу;"
   },
   {
      "name": "Вкажіть зайвий нормативний документ який не відноситься до діяльності засобів масової інформації в частині контролю за НПУ:",
      "value": "Закон України \"Про запобігання корупції\";"
   },
   {
      "name": "Вкажіть зайвий принцип в діяльності поліції:",
      "value": "демократизму."
   },
   {
      "name": "Вкажіть методи АЮДНПУ:",
      "value": "метод переконання та примусу;"
   },
   {
      "name": "Вкажіть послідовність дій передбачених статтею 18 Закону України Про Національну поліцію - коли звертаючись до особи, або у разі звернення особи до поліцейського, поліцейський зобов'язаний:",
      "value": "Назвати своє прізвище, посаду, спеціальне звання та пред'явити на її вимогу службове посвідчення;"
   },
   {
      "name": "Вкажіть правильне визначення, що таке юрисдикція:",
      "value": "визначається як сукупність повноважень відповідних державних органів, вирішувати правові спори і справи про правопорушення;"
   },
   {
      "name": "Громадянин, який звернувся із заявою чи скаргою до підрозділу поліції, має права, визначені ст. 18 Закону України \"Про звернення громадян\":",
      "value": "всі відповіді вірно."
   },
   {
      "name": "Громадянину за наслідками розгляду його скарги надається:",
      "value": "письмова або усна відповідь;"
   },
   {
      "name": "Дисциплінарне стягнення  не може бути накладено,  якщо з дня вчинення  проступку  минуло:",
      "value": "більше півроку;"
   },
   {
      "name": "Дисциплінарне стягнення може бути оскаржене:",
      "value": "протягом трьох місяців з дня ознайомлення з наказом;"
   },
   {
      "name": "До основних принципів дисциплінарного провадження відносять:",
      "value": "законність, презумпцію невинуватості, рівність усіх перед законом, гласність та економічність;"
   },
   {
      "name": "До перевірки звернень громадян можуть залучатися за згодою:",
      "value": "представники громадськості."
   },
   {
      "name": "До перевірки звернень громадян можуть залучатися за згодою:",
      "value": "представники громадськості."
   },
   {
      "name": "За своїм внутрішнім переконанням, що ґрунтується на всебічному, повному і об'єктивному дослідженні всіх обставин справи  в  їх  сукупності,  керуючись законом і правосвідомістю орган чи (посадова особа) робить:",
      "value": "Оцінку доказів."
   },
   {
      "name": "Загальну систему поліції складають:",
      "value": "центральний орган управління поліцією та територіальні органи поліції."
   },
   {
      "name": "Закон України Про заходи щодо попередження та зменшення вживання тютюнових виробів і їх шкідливого впливу на здоров'я населення зазначає, що частина  (частини)  будь-якої  будівлі, споруди,  яка доступна або відкрита для населення  вільно, чи за запрошенням,  або за плату, постійно, періодично або час від часу, в тому числі під'їзди, а також підземні переходи, стадіони це є:",
      "value": "Громадське місце."
   },
   {
      "name": "Залежно від кількісного складу суб'єктів подання скарги поділяються на:",
      "value": "колективні та індивідуальні."
   },
   {
      "name": "Засоби адміністративного запобігання це:",
      "value": "усі відповіді вірні."
   },
   {
      "name": "Заходи припинення можна поділити на:",
      "value": "загальні та спеціальні."
   },
   {
      "name": "Звернення військовослужбовців, а також членів їх сімей вирішуються в термін:",
      "value": "до 15 днів з моменту подання заяви;"
   },
   {
      "name": "Звернення розглядаються і вирішуються в термін:",
      "value": "не більше одного місяця від дня їх отримання."
   },
   {
      "name": "Звернення, які не потребують додаткового вивчення та проведення перевірки за ними, розглядаються у такий термін:",
      "value": "невідкладно, але не пізніше 15 днів від дня їх отримання."
   },
   {
      "name": "Згідно з чинним законодавством дисциплінарна відповідальність державних службовців, до яких належать і працівники Національної поліції України, настає за:",
      "value": "усі відповіді вірні."
   },
   {
      "name": "ЗУ \"Про Національну поліцію\" був прийнятий:",
      "value": "02 липня 2015 року;"
   },
   {
      "name": "Керівником та заступниками керівника поліції може бути призначена особа, яка:",
      "value": "всі відповіді вірні."
   },
   {
      "name": "Ким спрямовується та координується діяльність Національної поліції України:",
      "value": "Кабінетом Міністрів України та Міністром внутрішніх справ України;"
   },
   {
      "name": "Конституція України ст. 63 визначає \"близьких родичів\" до них відносимо:",
      "value": "подружжя, батьки (мати, батько) й дитина (діти), рідні брати і сестри, дід (бабуся) і онук (онука)."
   },
   {
      "name": "Не підлягають розгляду такі заяви:",
      "value": "особа яка визнана судом недієздатною;"
   },
   {
      "name": "Обраний поліцейський захід має бути:",
      "value": "законним, необхідним, пропорційним та ефективним;"
   },
   {
      "name": "Основними принципами провадження у справах про адміністративні правопорушення є:",
      "value": "усі відповіді вірні."
   },
   {
      "name": "Під час проведення превентивних поліцейських заходів поліція зобов'язана повідомити особі про причини застосування до неї превентивних заходів, а також довести до її відома нормативно-правові акти, на підставі яких застосовуються такі заходи:",
      "value": "Так зобов'язана;"
   },
   {
      "name": "Поліцейський захід-це:",
      "value": "це дія або комплекс дій превентивного або примусового характеру, що обмежує певні права і свободи людини та застосовується поліцейськими відповідно до закону для забезпечення виконання покладених на поліцію повноважень;"
   },
   {
      "name": "Поліцейський може застосовувати фізичну силу, у тому числі спеціальні прийоми боротьби (рукопашного бою), для:",
      "value": "всі відповіді вірні."
   },
   {
      "name": "Поліцейський при спілкуванні з громадянином повинен розмовляти з правопорушником:",
      "value": "Українською мовою;"
   },
   {
      "name": "Попередження як захід адміністративного стягнення може виноситься в усній формі:",
      "value": "Ні;"
   },
   {
      "name": "Посадові особи Національної поліції України, які компетентні приймати і розглядати скарги, в межах своїх повноважень зобов'язані:",
      "value": "забезпечувати поновлення порушених прав;"
   },
   {
      "name": "Принцип дотримання прав і свобод людини полягає:",
      "value": "у тому, що під час виконання своїх завдань поліція забезпечує дотримання прав і свобод людини, гарантованих Конституцією та законами України, а також міжнародними договорами України, згода на обов'язковість яких надана Верховною Радою України, і сприяє їх реалізації;"
   },
   {
      "name": "Рішення за розглядом скарги громадянина приймає:",
      "value": "керівник державного органу;"
   },
   {
      "name": "Скарга - це :",
      "value": "звернення з вимогою про захист законних інтересів громадян, порушених діями (бездіяльністю), рішеннями державних органів, органів місцевого самоврядування;"
   },
   {
      "name": "У разі вчинення протиправних діянь поліцейські несуть:",
      "value": "кримінальну, адміністративну, цивільно-правову та дисциплінарну відповідальність;"
   },
   {
      "name": "У разі групового скоєння адміністративних правопорушень складаються:",
      "value": "протокол на кожного правопорушника окремо;"
   },
   {
      "name": "Фактичною підставою порушення дисциплінарного провадження є:",
      "value": "вчинення працівником поліції діяння, яке містить ознаки дисциплінарного проступку, але наявність фактичної підстави не завжди тягне за собою порушення справи;"
   },
   {
      "name": "Хто є суб'єктами адміністративних правопорушень, які посягають на громадський порядок:",
      "value": "фізичні осудні особи, які на момент учинення правопорушення досягли 16-річного віку;"
   },
   {
      "name": "Цілі поліції, які перебувають на службі у громади, включають:",
      "value": "усі відповіді правильні."
   },
   {
      "name": "Що є підставою для порушення справи про адміністративне правопорушення і підставою для настання адміністративною відповідальністю:",
      "value": "скоєння особою (як фізичною, так і юридичною) адміністративного правопорушення;"
   },
   {
      "name": "Що відноситься до діянь, які кваліфікуються як дрібне хуліганство ст.173 КУпАП:",
      "value": "Нецензурна лайка в громадських місцях, образливе чіпляння до громадян та інші подібні дії"
   },
   {
      "name": "Що не відноситься до адміністративних стягнень (стаття 24 КУпАП):",
      "value": "Конвоювання затриманого;"
   },
   {
      "name": "Що не відноситься до доказів згідно статті 251 КУпАП:",
      "value": "Свідчення поліцейського;"
   },
   {
      "name": "Що не відноситься до загальних ознак взаємодії:",
      "value": "застосування превентивних методів переконання та примусу в разі виникнення підстав для їх застосування."
   },
   {
      "name": "Що не відноситься до обов'язкових умов, що засвідчують повноваження адвоката на участь у розгляді справи про адміністративне правопорушення згідно статті 271 КУпАП:",
      "value": "Усна домовленість сторін яка може відбутися при присутності поліцейського;"
   },
   {
      "name": "Що не відноситься до обставин, що пом'якшують відповідальність за адміністративне правопорушення:",
      "value": "Зізнання правопорушника;"
   },
   {
      "name": "Що не відноситься до прав особи, яка притягається до адміністративної відповідальності (статті 268 КУпАП):",
      "value": "робити адміністративний відвід зацікавлених осіб;"
   },
   {
      "name": "Які обставини не повинен з'ясувати поліцейський при розгляді справи про адміністративні правопорушення згідно статті 280 КУпАП:",
      "value": "Чи  було вчинено дисціплінарне правопорушення;"
   },
   {
      "name": "Яка з наведених стадій провадження про адміністративні правопорушення є факультативною:",
      "value": "оскарження (опротестування) постанови у справі;"
   },
   {
      "name": "Яка стаття КУпАП не відноситься до глави 14 в якій передбачувані адміністративні правопорушення, що посягають на громадський порядок і громадську безпеку:",
      "value": "Стаття 187. Порушення правил адміністративного нагляду."
   },
   {
      "name": "Яке одне із головних завдання поліції визначено європейськими країнами:",
      "value": "попередження злочинів;"
   },
   {
      "name": "Якого виду контролю з боку засобів масової інформації немає:",
      "value": "спостереження за діяльністю керівної ланки поліцейських органів з метою виявлення порушень законодавства, для забезпечення оптимального функціонування системи."
   },
    {
        "name": "Чим регулюються земельні відносини?",
        "value": "Конституцією України, Земельним кодексом України, а також прийнятими відповідно до них нормативно-правовими актами;"
    },
    {
        "name": "Система земельного права містить інститут?",
        "value": "юридичної відповідальності за порушення земельного законодавства;"
    },
    {
        "name": "Система земельного права — це?",
        "value": "сукупність правових інститутів, кожен з яких складається з групи юридичних норм, що регулюють однорідні земельні відносини;"
    },
    {
        "name": "Під принципами земельного права розуміють?",
        "value": "керівні засади у земельному законодавстві, що виражають сутність норм"
    }
]
